

{
  "version": "https://jsonfeed.org/version/1",
  
    "title": "Feed",
  
  "home_page_url": "https//test-np.netlify.app/np-site/",
  "feed_url": "https//test-np.netlify.app/np-site/feed.json",
  
    "description": "From Nwangele to the world",
  
  "icon": "https//test-np.netlify.app/np-site/assets/images/apple-touch-icon.png",
  "favicon": "https//test-np.netlify.app/np-site/assets/images/apple-touch-icon.png",
  
  "expired": false,
  "items": [
    
    

    

    
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/07/27/49",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/07/27/49/",
        
        "title": "Does the Corona virus (Covid-19) truly exists in Africa?",
        
        "content_html": "<p>Another online edition went by without anything exploding. AH-MAZ-ING. We had 3 mind-blowing talks. Sure, most of you probably missed it. That’s why we have video. All fixed in post. You’re welcome.</p>\n\n<p>It would be be less than a month, before the Danish People’s Party’s <strong>Pia Kjærsgaard</strong> would go from trivializing the harassment of Muslim women with headscarves while chastizing the women for provoking the reactions [in one blog post][article] to crying foul in response to reports of harassment of Jews wearing kippahs in Denmark [in another][post].[^translation]</p>\n\n<p>She writes August 11th:</p>\n\n<blockquote>\n  <p>Obviously, it’s different with Muslims—where the women are allowed to wear scarves, burka, and niqab.</p>\n\n  <p>I think it’s sad for Europe and sad for Denmark. The continent, which has exported democracy and enlightenment, is now not even capable of protecting its own citizens from assault. Yes, it is not only sad; it is, in fact, a disgrace.</p>\n\n  <p>It goes without saying that the Muslim immigration, which has taken place in recent decades, and which under the current administration has been increased, is a ticking time bomb under the traditionally, especially tolerant Danish society. Here, there has always been room for diversity, and the Danes have historically been accepting towards immigrants from many different countries.</p>\n</blockquote>\n\n<p>Compare this to her comments from July 14th on the harassment of Muslim women:</p>\n\n<blockquote>\n  <p>This Friday, [Danish newspaper] Politiken reported how Muslim women who wear headscarves felt overwhelmingly subjected to persecution, rudeness, and jeers on the street. I personally have never experienced such a thing, nor have I ever heard anyone talk about it, so perhaps the extent has been slightly exaggerated. I generally know the Danes as a well-mannered people, who, even though they do not feel great sympathy for the Muslim headscarf, naturally will not resort to foul language against the wearers of the headscarf.</p>\n\n  <p>Those Muslim women feel provoked by the reaction their headscarves elicit. I feel provoked, too. By them and their choice of the scarf over the Danish society![^muslims]</p>\n</blockquote>\n\n<p>The public and media were quick to pick up on the double standard; one tweet juxtaposing two of Kjærsgaard’s quotes in a graphic from <i>Arbejderen</i> (The Worker) went viral:</p>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/07/27/49/\" rel=\"nofollow\">Does the Corona virus (Covid-19) truly exists in Africa?</a> was originally published on Nwangele Post.</p>",
        "content_text": "Another online edition went by without anything exploding. AH-MAZ-ING. We had 3 mind-blowing talks. Sure, most of you probably missed it. That’s why we have video. All fixed in post. You’re welcome. It would be be less than a month, before the Danish People’s Party’s Pia Kjærsgaard would go from trivializing the harassment of Muslim women with headscarves while chastizing the women for provoking the reactions [in one blog post][article] to crying foul in response to reports of harassment of Jews wearing kippahs in Denmark [in another][post].[^translation] She writes August 11th: Obviously, it’s different with Muslims—where the women are allowed to wear scarves, burka, and niqab. I think it’s sad for Europe and sad for Denmark. The continent, which has exported democracy and enlightenment, is now not even capable of protecting its own citizens from assault. Yes, it is not only sad; it is, in fact, a disgrace. It goes without saying that the Muslim immigration, which has taken place in recent decades, and which under the current administration has been increased, is a ticking time bomb under the traditionally, especially tolerant Danish society. Here, there has always been room for diversity, and the Danes have historically been accepting towards immigrants from many different countries. Compare this to her comments from July 14th on the harassment of Muslim women: This Friday, [Danish newspaper] Politiken reported how Muslim women who wear headscarves felt overwhelmingly subjected to persecution, rudeness, and jeers on the street. I personally have never experienced such a thing, nor have I ever heard anyone talk about it, so perhaps the extent has been slightly exaggerated. I generally know the Danes as a well-mannered people, who, even though they do not feel great sympathy for the Muslim headscarf, naturally will not resort to foul language against the wearers of the headscarf. Those Muslim women feel provoked by the reaction their headscarves elicit. I feel provoked, too. By them and their choice of the scarf over the Danish society![^muslims] The public and media were quick to pick up on the double standard; one tweet juxtaposing two of Kjærsgaard’s quotes in a graphic from Arbejderen (The Worker) went viral:"
        
          , "summary": "Another online edition went by without anything exploding. AH-MAZ-ING. We had 3 mind-blowing talks. Sure, most of you probably missed it. That’s why we have video. All fixed in post. You’re welcome."
        
        
        
        
          
          , "tags": ["History","Inequality","Virus"]
        
        , "date_published": "2020-07-27T19:00:00+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Julia KhenKha"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/07/27/48",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/07/27/48/",
        
        "title": "Introducing a New Open Collection of Danish Polls",
        
        "content_html": "<p>Today, I think my collection of Danish opinion polls are mature enough to share with the public. They can be found on <a href=\"https://github.com/ndarville/danish-polls\">this</a> site.</p>\n\n<p>The political debate in Denmark is not doing well; pundits and talking heads take up all TV, print, and radio.</p>\n\n<p>The problem with this model is that many of those people aren’t basing their comments and analyses on any solid foundation centred around a proven, scientific model. They are not what people in the U.S. would call “wonks”—political-science nerds.</p>\n\n<p>Another fundamental problem is that the media and punditry don’t know how an opinion poll actually works. A poll is a snapshot with a statistical uncertainty. Most “movements in the polls” are results of short-lived moods and a statistical uncertainty that can make parties vacillate in polls.</p>\n\n<p><i>The New York Times</i>’s wonk vertical, <i>The Upshot</i>, explained the consequence of the statistical uncertainty brilliantly in <a href=\"http://www.nytimes.com/2014/05/02/upshot/how-not-to-be-misled-by-the-jobs-report.html\">this article</a>.</p>\n\n<p>As such, it is a problem that the media don’t get that you need to analyze the development in Danish politics based on a trend, and not by going from one poll to the next. You’ll keep seeing polls presented in the media as a bar chart—not a trend line over time. A bar chart at that, which doesn’t display the statistical uncertainty either.</p>\n\n<p>As of this writing, a panic has seized the Danish media world and British politics, because YouGov presented a poll showing more Yes votes than No votes to Scottish independence. Meanwhile, Sam Wang <a href=\"http://election.princeton.edu/2014/09/12/a-note-on-scottish-independence/\">is estimating</a> the probability of a Scottish No to be 95%—based on an <em>aggregate</em> of polls.</p>\n\n<p>There are several reasons why the American development towards a scientifically-informed political discourse didn’t come from the major new organisations, but from individuals with an academic background. One reason is that the media in Denmark tend to collaborate with a single polling institute; e.g. DR with Epinion and TV 2 with Megafon. It constrains them to basing their coverage on their own polling institute; meanwhile, the rest of us are free to include all public polls and draw a trend from them, which yields a more accurate picture:</p>\n\n<p><a href=\"/assets/danish-polls/image.png\"><img src=\"/assets/danish-polls/image.png\" alt=\"Trend line\" /></a></p>\n\n<p>We all deserve to participate in the political discussion, and by making polling data public, we can contribute to a salience sorely missed in the Danish coverage of politics.</p>\n\n<p>So start using the polls <a href=\"https://github.com/ndarville/danish-polls\">here</a>.</p>\n\n<h3 id=\"american-examples\">American Examples</h3>\n\n<ul>\n  <li><i><a href=\"http://themonkeycage.org/2007/11/20/why_this_blog/\">The Monkey Cage</a></i></li>\n  <li><a href=\"https://en.wikipedia.org/wiki/FiveThirtyEight\">Nate Silver &amp; FiveThirtyEight</a></li>\n  <li><a href=\"http://election.princeton.edu/\">Sam Wang</a></li>\n  <li><i><a href=\"http://nytimes.com/upshot/\">The Upshot</a></i></li>\n</ul>\n\n<h3 id=\"swedish-examples\">Swedish Examples</h3>\n\n<ul>\n  <li><a href=\"https://github.com/MansMeg/SwedishPolls\">Swedish Polls</a></li>\n  <li><a href=\"http://bottenada.se\">Botten Ada</a> (Swedish)</li>\n  <li><i><a href=\"http://trefyranio.com/english\">trefyranio</a></i> (349)</li>\n</ul>\n\n<h3 id=\"great-books\">Great Books</h3>\n<ul>\n  <li><i>The Gamble</i> (free, downloadable chapters <a href=\"http://themonkeycage.org/2013/01/24/new-e-chapter-of-the-gamble-available-its-free/\">here</a>)</li>\n</ul>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/07/27/48/\" rel=\"nofollow\">Introducing a New Open Collection of Danish Polls</a> was originally published on Nwangele Post.</p>",
        "content_text": "Today, I think my collection of Danish opinion polls are mature enough to share with the public. They can be found on this site. The political debate in Denmark is not doing well; pundits and talking heads take up all TV, print, and radio. The problem with this model is that many of those people aren’t basing their comments and analyses on any solid foundation centred around a proven, scientific model. They are not what people in the U.S. would call “wonks”—political-science nerds. Another fundamental problem is that the media and punditry don’t know how an opinion poll actually works. A poll is a snapshot with a statistical uncertainty. Most “movements in the polls” are results of short-lived moods and a statistical uncertainty that can make parties vacillate in polls. The New York Times’s wonk vertical, The Upshot, explained the consequence of the statistical uncertainty brilliantly in this article. As such, it is a problem that the media don’t get that you need to analyze the development in Danish politics based on a trend, and not by going from one poll to the next. You’ll keep seeing polls presented in the media as a bar chart—not a trend line over time. A bar chart at that, which doesn’t display the statistical uncertainty either. As of this writing, a panic has seized the Danish media world and British politics, because YouGov presented a poll showing more Yes votes than No votes to Scottish independence. Meanwhile, Sam Wang is estimating the probability of a Scottish No to be 95%—based on an aggregate of polls. There are several reasons why the American development towards a scientifically-informed political discourse didn’t come from the major new organisations, but from individuals with an academic background. One reason is that the media in Denmark tend to collaborate with a single polling institute; e.g. DR with Epinion and TV 2 with Megafon. It constrains them to basing their coverage on their own polling institute; meanwhile, the rest of us are free to include all public polls and draw a trend from them, which yields a more accurate picture: We all deserve to participate in the political discussion, and by making polling data public, we can contribute to a salience sorely missed in the Danish coverage of politics. So start using the polls here. American Examples The Monkey Cage Nate Silver &amp; FiveThirtyEight Sam Wang The Upshot Swedish Examples Swedish Polls Botten Ada (Swedish) trefyranio (349) Great Books The Gamble (free, downloadable chapters here)"
        
          , "summary": "Today, I think my collection of Danish opinion polls are mature enough to share with the public. They can be found on this site."
        
        
        
        
          
          , "tags": ["History","Inequality","Virus"]
        
        , "date_published": "2020-07-27T09:00:00+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Julia KhenKha"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/07/25/50",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/07/25/50/",
        
        "title": "A Double Standard for Street Harassment of Muslims and Jews Does Not Go Unnoticed",
        
        "content_html": "<p>It would be be less than a month, before the Danish People’s Party’s <strong>Pia Kjærsgaard</strong> would go from trivializing the harassment of Muslim women with headscarves while chastizing the women for provoking the reactions <a href=\"/articles/2014/07/25/danish-peoples-party-and-headscarves.html\">in one blog post</a> to crying foul in response to reports of harassment of Jews wearing kippahs in Denmark <a href=\"http://politik.tv2.dk/2014-08-11-vi-skal-ikke-acceptere-gaza-i-danmark\">in another</a>.<sup id=\"fnref:translation\"><a href=\"#fn:translation\" class=\"footnote\">1</a></sup></p>\n\n<p>She writes August 11th:</p>\n\n<blockquote>\n  <p>Obviously, it’s different with Muslims—where the women are allowed to wear scarves, burka, and niqab.</p>\n\n  <p>I think it’s sad for Europe and sad for Denmark. The continent, which has exported democracy and enlightenment, is now not even capable of protecting its own citizens from assault. Yes, it is not only sad; it is, in fact, a disgrace.</p>\n\n  <p>It goes without saying that the Muslim immigration, which has taken place in recent decades, and which under the current administration has been increased, is a ticking time bomb under the traditionally, especially tolerant Danish society. Here, there has always been room for diversity, and the Danes have historically been accepting towards immigrants from many different countries.</p>\n</blockquote>\n\n<p>Compare this to her comments from July 14th on the harassment of Muslim women:</p>\n\n<blockquote>\n  <p>This Friday, [Danish newspaper] Politiken reported how Muslim women who wear headscarves felt overwhelmingly subjected to persecution, rudeness, and jeers on the street. I personally have never experienced such a thing, nor have I ever heard anyone talk about it, so perhaps the extent has been slightly exaggerated. I generally know the Danes as a well-mannered people, who, even though they do not feel great sympathy for the Muslim headscarf, naturally will not resort to foul language against the wearers of the headscarf.</p>\n\n  <p>Those Muslim women feel provoked by the reaction their headscarves elicit. I feel provoked, too. By them and their choice of the scarf over the Danish society!<sup id=\"fnref:muslims\"><a href=\"#fn:muslims\" class=\"footnote\">2</a></sup></p>\n</blockquote>\n\n<p>The public and media were quick to pick up on the double standard; one tweet juxtaposing two of Kjærsgaard’s quotes in a graphic from <i>Arbejderen</i> (The Worker) went viral:</p>\n\n<blockquote class=\"twitter-tweet\" lang=\"en\">\n    <p>I dag skal vi have en lektion i dobbeltmoral <a href=\"https://twitter.com/hashtag/dkpol?src=hash\">#dkpol</a> <a href=\"http://t.co/IzxVmR5ysT\">pic.twitter.com/IzxVmR5ysT</a></p>&mdash; Abdel Aziz Mahmoud (@AbdelsTweet) <a href=\"https://twitter.com/AbdelsTweet/statuses/500557753359024129\">August 16, 2014</a>\n</blockquote>\n\n<p>The tweet reads “Today we’re getting a lesson in double standards”.</p>\n\n<script async=\"\" src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<h3 id=\"further-reading-and-watching\">Further Reading and Watching</h3>\n\n<ul>\n  <li><a href=\"http://www.b.dk/politiko/pia-k-uanstaendigt-at-sammenligne-kalot-og-toerklaede\">“Pia K: Unseemly to Compare Kippah and Scarf”</a> (Danish interview)</li>\n  <li><a href=\"http://www.dr.dk/tv/se/deadline/deadline-713\">Danish TV interview with Kjærsgaard</a> (<a href=\"http://vpodcast.dr.dk/DR2/deadline2230/2014/deadline2230_140818223000.mp4\">direct link</a>)</li>\n  <li><a href=\"http://ekstrabladet.dk/nyheder/frontalt/article4974860.ece\">Kjærsgaard debates law student Natasha Al-Hariri</a> (Danish)</li>\n  <li><a href=\"http://www.thelocal.dk/20140816/kippah-march-goes-off-without-drama\">“‘Kippah March’ Goes Off without Drama”</a> (English)</li>\n</ul>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:translation\">\n      <p>Full translation of Kjærsgaard’s remarks on the harassment of Jews <a href=\"https://gist.github.com/ndarville/5130a558e8b649ac7019\">here</a>. <a href=\"#fnref:translation\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:muslims\">\n      <p>Revisit Kjærsgaard’s original remarks in the <i>Hafnia Times</i>’s <a href=\"/articles/2014/07/25/danish-peoples-party-and-headscarves.html\">article</a> on the street harassment of Muslim women in Denmark. <a href=\"#fnref:muslims\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/07/25/50/\" rel=\"nofollow\">A Double Standard for Street Harassment of Muslims and Jews Does Not Go Unnoticed</a> was originally published on Nwangele Post.</p>",
        "content_text": "It would be be less than a month, before the Danish People’s Party’s Pia Kjærsgaard would go from trivializing the harassment of Muslim women with headscarves while chastizing the women for provoking the reactions in one blog post to crying foul in response to reports of harassment of Jews wearing kippahs in Denmark in another.1 She writes August 11th: Obviously, it’s different with Muslims—where the women are allowed to wear scarves, burka, and niqab. I think it’s sad for Europe and sad for Denmark. The continent, which has exported democracy and enlightenment, is now not even capable of protecting its own citizens from assault. Yes, it is not only sad; it is, in fact, a disgrace. It goes without saying that the Muslim immigration, which has taken place in recent decades, and which under the current administration has been increased, is a ticking time bomb under the traditionally, especially tolerant Danish society. Here, there has always been room for diversity, and the Danes have historically been accepting towards immigrants from many different countries. Compare this to her comments from July 14th on the harassment of Muslim women: This Friday, [Danish newspaper] Politiken reported how Muslim women who wear headscarves felt overwhelmingly subjected to persecution, rudeness, and jeers on the street. I personally have never experienced such a thing, nor have I ever heard anyone talk about it, so perhaps the extent has been slightly exaggerated. I generally know the Danes as a well-mannered people, who, even though they do not feel great sympathy for the Muslim headscarf, naturally will not resort to foul language against the wearers of the headscarf. Those Muslim women feel provoked by the reaction their headscarves elicit. I feel provoked, too. By them and their choice of the scarf over the Danish society!2 The public and media were quick to pick up on the double standard; one tweet juxtaposing two of Kjærsgaard’s quotes in a graphic from Arbejderen (The Worker) went viral: I dag skal vi have en lektion i dobbeltmoral #dkpol pic.twitter.com/IzxVmR5ysT&mdash; Abdel Aziz Mahmoud (@AbdelsTweet) August 16, 2014 The tweet reads “Today we’re getting a lesson in double standards”. Further Reading and Watching “Pia K: Unseemly to Compare Kippah and Scarf” (Danish interview) Danish TV interview with Kjærsgaard (direct link) Kjærsgaard debates law student Natasha Al-Hariri (Danish) “‘Kippah March’ Goes Off without Drama” (English) Full translation of Kjærsgaard’s remarks on the harassment of Jews here. &#8617; Revisit Kjærsgaard’s original remarks in the Hafnia Times’s article on the street harassment of Muslim women in Denmark. &#8617;"
        
          , "summary": "It would be be less than a month, before the Danish People’s Party’s Pia Kjærsgaard would go from trivializing the harassment of Muslim women with headscarves while chastizing the women for provoking the reactions in one blog post to crying foul in response to reports of harassment of Jews wearing kippahs in Denmark in another.1 Full translation of Kjærsgaard’s remarks on the harassment of Jews [here][translation]. &#8617;"
        
        
        
        
          
          , "tags": ["Gender","History","Inequality"]
        
        , "date_published": "2020-07-25T11:00:00+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Charles Onyekuru"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/07/21/The%20unconventionall-history-of%20-the-nwangele-river",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/07/21/The-unconventionall-history-of-the-nwangele-river/",
        
        "title": "The Unconventional history and impact of the Nwangele river",
        
        "content_html": "<p>On Thursday the 28th, people in Denmark was confounded to receive a bulletin from the Copenhagen police concerning a person exhibiting “suspicious behaviour”.</p>\n\n<p>People following the development on Twitter would experience it like this:</p>\n\n<p>What, exactly, sent Copenhagen into high alert?</p>\n\n<p><strong>Alisiv Ceran</strong> is a 21-year-old English and Mandarin student at the University of Copenhagen. He was on the train heading for a written exam on the subject of the War on Terror for his course on American history.</p>\n\n<p>As this was the kind of test you have 24 hours to prepare for, operating on three to four hours of sleep, Ceran was still going through his book on 9-11 on the ride towards his destination. Nervous about the impending exam, he locked eyes with a fellow passenger by Nørreport train station and attempted a smile, but knocked over his luggage case which contained the printer he had to bring for the exam.</p>\n\n<p>The woman he had clumsily attempted a smile at was, apparently, so distraught by the experience that she called the police to tip them off to what she perceived as “suspicious behaviour”. The police found her a “very credible” witness and kicked everything into gear.</p>\n\n<p>Once more, here is the police’s version of how events transpired in their final press statement on the false alarm:</p>\n\n<blockquote>\n  <p>This morning, Copenhagen Police received a report of a person in a train who exhibited suspicious behaviour. After the police’s assessment of the report, it was decided to start a search for the person, as we wanted to clear up what was behind the behaviour. The police concluded that the witness was very credible and takes such reports seriously.</p>\n\n  <p>- We have nothing but good reason to praise [/applaud] the reporter for being alert and for doing the only right thing, which is to contact the police about their observations. It creates a feeling of safety in the society that the citizen wishes to aid the police, says vice chief superintendent Claus Hjelm Olsen, who lead today’s police operation.</p>\n\n  <p>- We are aware that a massive police presence can create a certain discomfort, so we found it important to inform the population about what the background was, says Claus Hjelm Olsen.</p>\n\n  <p>Copenhagen Police’s massive effort had the intent of uncovering whether there was a criminal situation. When the wanted person was identified and approached, it turned out that it was a case of a perfectly legal situation, and the search was called off.</p>\n\n  <p>- We have received great help from the population, who’ve reacted appropriately during the situation. Based on our use of Twitter, we received great tips in our Service Centre. Huge kudos [/applause] to the public and the wanted’s family for their way of handling the situation. The wanted person, too, has handled all the ruckus with an understanding of the police’s reaction, and we want to emphasize that he in no way was known by the police already, says Claus Hjelm Olsen.</p>\n</blockquote>\n\n<h3 id=\"interviewsonce-everything-had-calmed-down\">Interviews—Once Everything Had Calmed Down</h3>\n\n<ul>\n  <li><i><a href=\"http://www.dr.dk/Nyheder/Indland/2014/08/28/152102.htm\">Danish Radio (DR)</a></i></li>\n  <li><i><a href=\"http://nyhederne.tv2.dk/krimi/2014-08-28-bombemand-var-uskyldig-studerende\">TV 2</a></i></li>\n  <li>\n    <p><i><a href=\"http://www.b.dk/nationalt/maalet-for-menneskejagten-mange-tror-det-vaerste-om-folk-som-mig\">Berlingske Tidende</a></i></p>\n\n    <blockquote>\n      <p><strong>Interviewer</strong>: Are you shocked that so little from your side of the train could set off so much?</p>\n\n      <p><strong>Ceran</strong>: Not really. I think a lot of people assume the worst about people like me. That people who look like me and have a beard like me are probably terrorists. There are probably many who don’t know a single person who looks like me. I can understand that the woman was a little scared[.]</p>\n    </blockquote>\n  </li>\n  <li>\n    <p><i><a href=\"http://politiken.dk/indland/ECE2380165/offer-for-politi--og-mediejagt-jeg-vil-bare-gerne-vaere-gymnasielaerer/\">Politiken</a></i></p>\n\n    <blockquote>\n      <p><strong>Interviewer</strong>: You weren’t thinking about how your behaviour might appear suspicious in the train?</p>\n\n      <p><strong>Ceran</strong>: Not at all. But I have a beard and a dark appearance. In the media, it’s always people like me who are the extremists. I will say, though, that if I actually were a terrorist, why would I be sitting and reading a book about it, but not carrying out the attack instead?</p>\n\n      <p><strong>Interviewer</strong>: Does it make you think that you shouldn’t be sitting and reading a book on terror the next time on the train?</p>\n\n      <p><strong>Ceran</strong>: I will try to be more careful with my demeanour and talk to people around me, so they don’t fear that something is amiss. And give them a smile.</p>\n    </blockquote>\n  </li>\n</ul>\n\n<p>And what of the police? Ceran had to lock himself into a accessible toilet as a precaution against people who might attempt a citizen’s arrest on him—or worse. From here, he called the police himself to set the record straight. Below is an excerpt of <i>Politiken</i>’s <a href=\"http://politiken.dk/indland/ECE2379596/politidirektoer-efter-menneskejagt-vi-har-ikke-noget-at-undskylde/\">interview</a> with police commissioner Thorkild Fogde.</p>\n\n<blockquote>\n  <p><strong>Interviewer</strong>: When you get a hold of [the former suspect], will you give him an apology?</p>\n\n  <p><strong>Police</strong>: “No, I don’t believe we have anything to apologize for. But I am going to explain to him why we react the way we do, so he has an understanding of it. But I don’t believe the police should apologize for taking the safety of the population seriously. It is our job, and even there was no terror threat in the specific case, we are not going to get around how there is an increased threat level against Denmark in general these years”, says Thorkild Fogde.</p>\n</blockquote>\n\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/07/21/The-unconventionall-history-of-the-nwangele-river/\" rel=\"nofollow\">The Unconventional history and impact of the Nwangele river</a> was originally published on Nwangele Post.</p>",
        "content_text": "On Thursday the 28th, people in Denmark was confounded to receive a bulletin from the Copenhagen police concerning a person exhibiting “suspicious behaviour”. People following the development on Twitter would experience it like this: What, exactly, sent Copenhagen into high alert? Alisiv Ceran is a 21-year-old English and Mandarin student at the University of Copenhagen. He was on the train heading for a written exam on the subject of the War on Terror for his course on American history. As this was the kind of test you have 24 hours to prepare for, operating on three to four hours of sleep, Ceran was still going through his book on 9-11 on the ride towards his destination. Nervous about the impending exam, he locked eyes with a fellow passenger by Nørreport train station and attempted a smile, but knocked over his luggage case which contained the printer he had to bring for the exam. The woman he had clumsily attempted a smile at was, apparently, so distraught by the experience that she called the police to tip them off to what she perceived as “suspicious behaviour”. The police found her a “very credible” witness and kicked everything into gear. Once more, here is the police’s version of how events transpired in their final press statement on the false alarm: This morning, Copenhagen Police received a report of a person in a train who exhibited suspicious behaviour. After the police’s assessment of the report, it was decided to start a search for the person, as we wanted to clear up what was behind the behaviour. The police concluded that the witness was very credible and takes such reports seriously. - We have nothing but good reason to praise [/applaud] the reporter for being alert and for doing the only right thing, which is to contact the police about their observations. It creates a feeling of safety in the society that the citizen wishes to aid the police, says vice chief superintendent Claus Hjelm Olsen, who lead today’s police operation. - We are aware that a massive police presence can create a certain discomfort, so we found it important to inform the population about what the background was, says Claus Hjelm Olsen. Copenhagen Police’s massive effort had the intent of uncovering whether there was a criminal situation. When the wanted person was identified and approached, it turned out that it was a case of a perfectly legal situation, and the search was called off. - We have received great help from the population, who’ve reacted appropriately during the situation. Based on our use of Twitter, we received great tips in our Service Centre. Huge kudos [/applause] to the public and the wanted’s family for their way of handling the situation. The wanted person, too, has handled all the ruckus with an understanding of the police’s reaction, and we want to emphasize that he in no way was known by the police already, says Claus Hjelm Olsen. Interviews—Once Everything Had Calmed Down Danish Radio (DR) TV 2 Berlingske Tidende Interviewer: Are you shocked that so little from your side of the train could set off so much? Ceran: Not really. I think a lot of people assume the worst about people like me. That people who look like me and have a beard like me are probably terrorists. There are probably many who don’t know a single person who looks like me. I can understand that the woman was a little scared[.] Politiken Interviewer: You weren’t thinking about how your behaviour might appear suspicious in the train? Ceran: Not at all. But I have a beard and a dark appearance. In the media, it’s always people like me who are the extremists. I will say, though, that if I actually were a terrorist, why would I be sitting and reading a book about it, but not carrying out the attack instead? Interviewer: Does it make you think that you shouldn’t be sitting and reading a book on terror the next time on the train? Ceran: I will try to be more careful with my demeanour and talk to people around me, so they don’t fear that something is amiss. And give them a smile. And what of the police? Ceran had to lock himself into a accessible toilet as a precaution against people who might attempt a citizen’s arrest on him—or worse. From here, he called the police himself to set the record straight. Below is an excerpt of Politiken’s interview with police commissioner Thorkild Fogde. Interviewer: When you get a hold of [the former suspect], will you give him an apology? Police: “No, I don’t believe we have anything to apologize for. But I am going to explain to him why we react the way we do, so he has an understanding of it. But I don’t believe the police should apologize for taking the safety of the population seriously. It is our job, and even there was no terror threat in the specific case, we are not going to get around how there is an increased threat level against Denmark in general these years”, says Thorkild Fogde."
        
          , "summary": "On Thursday the 28th, people in Denmark was confounded to receive a bulletin from the Copenhagen police concerning a person exhibiting “suspicious behaviour”."
        
        
        
        
          
          , "tags": ["History","Local Government","Nwangele"]
        
        , "date_published": "2020-07-21T18:16:49+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Jude Amadi"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/07/21/Daunting-ineualities",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/07/21/Daunting-ineualities/",
        
        "title": "The Daunting inequalities faced today in modern archiac society",
        
        "content_html": "<p>My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges.</p>\n\n<h3 id=\"major-challenge-faced-so-far\">Major Challenge Faced So Far</h3>\n\n<p>The major challenge I think I’ve faced so far is working with git. I have worked with git in the past but not like I’ve had to within this past few weeks on this project. My issue with git started during the contribution period when I had to rebase my changes with the upstream master, there was a lot of back and forth between me and my mentor because she couldn’t merge my pull request due to the conflicts. All these back and forth and time wasting happened simply becuase I was ashamed to tell my mentor that I had issues with git especially since it wasn’t an issue with the project itself. I thought it would make her look down on me but I was wrong.  This issue took me days to resolve and after trying all I could, I just opted to delete my branch and create a clean branch to work on. At that time I was happy and relieved since I had found a way to get rid of the problem, but the truth is I didn’t fix the issue I only found a way around it, which wasn’t sustainable because I can’t keep deleting branches whenever there’s a merge conflict but I didn’t think of this at that time.</p>\n\n<p>I came across the same problem after I started my internship, and since I only bypassed it the first time, I couldn’t solve it, my commits kept increasing trying to resolve conflicts that still resurfaced when my mentor tried to merge, It was like I was going in circles, I was stuck again, and I couldn’t delete my branch again like I did initially so this time, I sought for help from my mentor. We had a chat session where she put me through <code class=\"highlighter-rouge\">merging commits</code>, <code class=\"highlighter-rouge\">rebasing my branch with the upstream master</code> and from this session I got to see all the errors I was making and fixed them. I also made sure to note down all the commands we used for future reference. And that was how I was able to solve a problem I had battled with for days in just few minutes with the help of my mentor.</p>\n\n<h3 id=\"lesson-learnt\">Lesson Learnt</h3>\n\n<p>Nobody is perfect, just as no man is an Island. I could have saved so much time if I had simply just asked for help from my mentor or the community when I encountered difficulty in fixing the issue the first time, but I didn’t. There is no shame in making mistakes and facing challenges, it’s a something everyone at the top has passed through and can relate to, and the best thing to do when such situations happen is to fix them and learn from them so you don’t make those mistakes or face those challenges again and even if you do or encounter someone else facing the same challenge which is possible, fixing it wouldn’t be a problem.</p>\n\n<p>Another improtant lesson learnt is <code class=\"highlighter-rouge\">do not take shortcuts</code>. As a developer, I know how frustrating challenges and bugs can be especially when you are on a timeline, and how tempting it can be to take the easier route which in most cases, is just a workaround and not exactly a solution to the problem. Yeah, it may seem better at the moment but the truth is most times, these solutions aren’t sustainable and can even lead to even more bugs to manage, thereby wasting more time and resources. So my advice will be to ask questions, research and don’t stay glued to your screen for long hours trying to solve the same problem because at some point you start to try the same things over and over again, expecting to get a different result and when you don’t, you get dissapointed. So instead of working long hours at a stretch, take breaks, when you get back you might be able to look at things a bit differently and when you finally fix that bug, issue, mistake, challenge or whatever it may be, <code class=\"highlighter-rouge\">document</code> everything. Do not just assume you have known it and can’t forget, be sure to put down your findings so when you or anyone else passes through the same issue, you can pass your solution on to them easily and save yourselves a lot of time.</p>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/07/21/Daunting-ineualities/\" rel=\"nofollow\">The Daunting inequalities faced today in modern archiac society</a> was originally published on Nwangele Post.</p>",
        "content_text": "My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges. Major Challenge Faced So Far The major challenge I think I’ve faced so far is working with git. I have worked with git in the past but not like I’ve had to within this past few weeks on this project. My issue with git started during the contribution period when I had to rebase my changes with the upstream master, there was a lot of back and forth between me and my mentor because she couldn’t merge my pull request due to the conflicts. All these back and forth and time wasting happened simply becuase I was ashamed to tell my mentor that I had issues with git especially since it wasn’t an issue with the project itself. I thought it would make her look down on me but I was wrong. This issue took me days to resolve and after trying all I could, I just opted to delete my branch and create a clean branch to work on. At that time I was happy and relieved since I had found a way to get rid of the problem, but the truth is I didn’t fix the issue I only found a way around it, which wasn’t sustainable because I can’t keep deleting branches whenever there’s a merge conflict but I didn’t think of this at that time. I came across the same problem after I started my internship, and since I only bypassed it the first time, I couldn’t solve it, my commits kept increasing trying to resolve conflicts that still resurfaced when my mentor tried to merge, It was like I was going in circles, I was stuck again, and I couldn’t delete my branch again like I did initially so this time, I sought for help from my mentor. We had a chat session where she put me through merging commits, rebasing my branch with the upstream master and from this session I got to see all the errors I was making and fixed them. I also made sure to note down all the commands we used for future reference. And that was how I was able to solve a problem I had battled with for days in just few minutes with the help of my mentor. Lesson Learnt Nobody is perfect, just as no man is an Island. I could have saved so much time if I had simply just asked for help from my mentor or the community when I encountered difficulty in fixing the issue the first time, but I didn’t. There is no shame in making mistakes and facing challenges, it’s a something everyone at the top has passed through and can relate to, and the best thing to do when such situations happen is to fix them and learn from them so you don’t make those mistakes or face those challenges again and even if you do or encounter someone else facing the same challenge which is possible, fixing it wouldn’t be a problem. Another improtant lesson learnt is do not take shortcuts. As a developer, I know how frustrating challenges and bugs can be especially when you are on a timeline, and how tempting it can be to take the easier route which in most cases, is just a workaround and not exactly a solution to the problem. Yeah, it may seem better at the moment but the truth is most times, these solutions aren’t sustainable and can even lead to even more bugs to manage, thereby wasting more time and resources. So my advice will be to ask questions, research and don’t stay glued to your screen for long hours trying to solve the same problem because at some point you start to try the same things over and over again, expecting to get a different result and when you don’t, you get dissapointed. So instead of working long hours at a stretch, take breaks, when you get back you might be able to look at things a bit differently and when you finally fix that bug, issue, mistake, challenge or whatever it may be, document everything. Do not just assume you have known it and can’t forget, be sure to put down your findings so when you or anyone else passes through the same issue, you can pass your solution on to them easily and save yourselves a lot of time."
        
          , "summary": "My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges."
        
        
        
        
          
          , "tags": ["Gender","History","Inequality"]
        
        , "date_published": "2020-07-21T18:16:49+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Charles Onyekuru"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/07/07/lga-chairman-initiates-inspection-committe",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/07/07/lga-chairman-initiates-inspection-committe/",
        
        "title": "LGA chairman initiates inspection committes",
        
        "content_html": "<p>My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges.</p>\n\n<p>The major challenge I think I’ve faced so far is working with git. I have worked with git in the past but not like I’ve had to within this past few weeks on this project. My issue with git started during the contribution period when I had to rebase my changes with the upstream master, there was a lot of back and forth between me and my mentor because she couldn’t merge my pull request due to the conflicts. All these back and forth and time wasting happened simply becuase I was ashamed to tell my mentor that I had issues with git especially since it wasn’t an issue with the project itself. I thought it would make her look down on me but I was wrong.  This issue took me days to resolve and after trying all I could, I just opted to delete my branch and create a clean branch to work on. At that time I was happy and relieved since I had found a way to get rid of the problem, but the truth is I didn’t fix the issue I only found a way around it, which wasn’t sustainable because I can’t keep deleting branches whenever there’s a merge conflict but I didn’t think of this at that time.</p>\n\n<p>I came across the same problem after I started my internship, and since I only bypassed it the first time, I couldn’t solve it, my commits kept increasing trying to resolve conflicts that still resurfaced when my mentor tried to merge, It was like I was going in circles, I was stuck again, and I couldn’t delete my branch again like I did initially so this time, I sought for help from my mentor. We had a chat session where she put me through <code class=\"highlighter-rouge\">merging commits</code>, <code class=\"highlighter-rouge\">rebasing my branch with the upstream master</code> and from this session I got to see all the errors I was making and fixed them. I also made sure to note down all the commands we used for future reference. And that was how I was able to solve a problem I had battled with for days in just few minutes with the help of my mentor.</p>\n\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/07/07/lga-chairman-initiates-inspection-committe/\" rel=\"nofollow\">LGA chairman initiates inspection committes</a> was originally published on Nwangele Post.</p>",
        "content_text": "My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges. The major challenge I think I’ve faced so far is working with git. I have worked with git in the past but not like I’ve had to within this past few weeks on this project. My issue with git started during the contribution period when I had to rebase my changes with the upstream master, there was a lot of back and forth between me and my mentor because she couldn’t merge my pull request due to the conflicts. All these back and forth and time wasting happened simply becuase I was ashamed to tell my mentor that I had issues with git especially since it wasn’t an issue with the project itself. I thought it would make her look down on me but I was wrong. This issue took me days to resolve and after trying all I could, I just opted to delete my branch and create a clean branch to work on. At that time I was happy and relieved since I had found a way to get rid of the problem, but the truth is I didn’t fix the issue I only found a way around it, which wasn’t sustainable because I can’t keep deleting branches whenever there’s a merge conflict but I didn’t think of this at that time. I came across the same problem after I started my internship, and since I only bypassed it the first time, I couldn’t solve it, my commits kept increasing trying to resolve conflicts that still resurfaced when my mentor tried to merge, It was like I was going in circles, I was stuck again, and I couldn’t delete my branch again like I did initially so this time, I sought for help from my mentor. We had a chat session where she put me through merging commits, rebasing my branch with the upstream master and from this session I got to see all the errors I was making and fixed them. I also made sure to note down all the commands we used for future reference. And that was how I was able to solve a problem I had battled with for days in just few minutes with the help of my mentor."
        
          , "summary": "My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges."
        
        
        
        
          
          , "tags": ["Government","Local Government","Nwangele"]
        
        , "date_published": "2020-07-07T18:16:49+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Onyeka Ngozi"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/07/07/welcome-to-jekyll",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/07/07/welcome-to-jekyll/",
        
        "title": "Welcome to Jekyll! Jekyll your way through the world of Static site generators",
        
        "content_html": "<p>You’ll find this post in your <code class=\"highlighter-rouge\">_posts</code> directory. Go ahead and edit it and re-build the site to see your changes. You can rebuild the site in many different ways, but the most common way is to run <code class=\"highlighter-rouge\">jekyll serve</code>, which launches a web server and auto-regenerates your site when a file is updated.</p>\n\n<p>Jekyll requires blog post files to be named according to the following format:</p>\n\n<p><code class=\"highlighter-rouge\">YEAR-MONTH-DAY-title.MARKUP</code></p>\n\n<p>Where <code class=\"highlighter-rouge\">YEAR</code> is a four-digit number, <code class=\"highlighter-rouge\">MONTH</code> and <code class=\"highlighter-rouge\">DAY</code> are both two-digit numbers, and <code class=\"highlighter-rouge\">MARKUP</code> is the file extension representing the format used in the file. After that, include the necessary front matter. Take a look at the source for this post to get an idea about how it works.</p>\n\n<p>Jekyll also offers powerful support for code snippets:</p>\n\n<figure class=\"highlight\"><pre><code class=\"language-ruby\" data-lang=\"ruby\"><span class=\"k\">def</span> <span class=\"nf\">print_hi</span><span class=\"p\">(</span><span class=\"nb\">name</span><span class=\"p\">)</span>\n  <span class=\"nb\">puts</span> <span class=\"s2\">\"Hi, </span><span class=\"si\">#{</span><span class=\"nb\">name</span><span class=\"si\">}</span><span class=\"s2\">\"</span>\n<span class=\"k\">end</span>\n<span class=\"n\">print_hi</span><span class=\"p\">(</span><span class=\"s1\">'Tom'</span><span class=\"p\">)</span>\n<span class=\"c1\">#=&gt; prints 'Hi, Tom' to STDOUT.</span></code></pre></figure>\n\n<p>Check out the <a href=\"https://jekyllrb.com/docs/home\">Jekyll docs</a> for more info on how to get the most out of Jekyll. File all bugs/feature requests at <a href=\"https://github.com/jekyll/jekyll\">Jekyll’s GitHub repo</a>. If you have questions, you can ask them on <a href=\"https://talk.jekyllrb.com/\">Jekyll Talk</a>.</p>\n\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/07/07/welcome-to-jekyll/\" rel=\"nofollow\">Welcome to Jekyll! Jekyll your way through the world of Static site generators</a> was originally published on Nwangele Post.</p>",
        "content_text": "You’ll find this post in your _posts directory. Go ahead and edit it and re-build the site to see your changes. You can rebuild the site in many different ways, but the most common way is to run jekyll serve, which launches a web server and auto-regenerates your site when a file is updated. Jekyll requires blog post files to be named according to the following format: YEAR-MONTH-DAY-title.MARKUP Where YEAR is a four-digit number, MONTH and DAY are both two-digit numbers, and MARKUP is the file extension representing the format used in the file. After that, include the necessary front matter. Take a look at the source for this post to get an idea about how it works. Jekyll also offers powerful support for code snippets: def print_hi(name) puts \"Hi, #{name}\" end print_hi('Tom') #=&gt; prints 'Hi, Tom' to STDOUT. Check out the Jekyll docs for more info on how to get the most out of Jekyll. File all bugs/feature requests at Jekyll’s GitHub repo. If you have questions, you can ask them on Jekyll Talk."
        
          , "summary": "You’ll find this post in your _posts directory. Go ahead and edit it and re-build the site to see your changes. You can rebuild the site in many different ways, but the most common way is to run jekyll serve, which launches a web server and auto-regenerates your site when a file is updated."
        
        
        
        
          
          , "tags": ["Frameworks","Jekyll"]
        
        , "date_published": "2020-07-07T18:16:49+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Onyeka Ngozi"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/feature/2020/07/07/Thearitical-images-of-the-tombstone",
        "url": "https//test-np.netlify.app/np-site/feature/2020/07/07/Thearitical-images-of-the-tombstone/",
        
        "title": "The thearitical fortunes of African rich and famous families and its cost on the growth and well being of society",
        
        "content_html": "<p>You’ll find this post in your <code class=\"highlighter-rouge\">_posts</code> directory. This post along with all of the other example posts is paginated by the new <a href=\"https://github.com/sverrirs/jekyll-paginate-v2\">jekyll-paginate-v2 gem</a>.</p>\n\n<p>This pagination gem is built specially for Jekyll 3 and newer and is intended to replace the now discontinuted jekyll-paginate gem.</p>\n\n<p>This v2 of the gem offers full backwards compatibility with the old gem and its site configuration. You can simply replace the old jekyll-paginate gem with this one and your sites will still work without any changes.</p>\n\n<p>However to access the new enhanced features of this gem, like pagination on categories, tags and locales, then you need to remove the old jekyll-paginate configuration and activate the new <code class=\"highlighter-rouge\">pagination:</code> <a href=\"https://github.com/sverrirs/jekyll-paginate-v2#site-configuration\">site configuration</a>.</p>\n\n<p>The <a href=\"https://github.com/sverrirs/jekyll-paginate-v2/tree/master/examples\">source code</a> for this example project will show you all the necessary steps.</p>\n\n<h2 id=\"installing\">Installing</h2>\n\n<p>Go ahead and install the latest version of the gem from <a href=\"https://rubygems.org/gems/jekyll-paginate-v2\">rubygems.org</a></p>\n\n<div class=\"highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>gem install jekyll-paginate-v2\n</code></pre></div></div>\n\n<p>Replace the <code class=\"highlighter-rouge\">jekyll-paginate</code> gem with <code class=\"highlighter-rouge\">jekyll-paginate-v2</code> in both your <code class=\"highlighter-rouge\">_config.yml</code> and your <code class=\"highlighter-rouge\">Gemfile</code>.</p>\n\n<p>Now go ahead and re-build your site to start running the new pagination logic. You can rebuild the site in many different ways, but the most common way is to run <code class=\"highlighter-rouge\">jekyll serve</code>, which launches a web server and auto-regenerates your site when a file is updated.</p>\n\n<p>Please see the <a href=\"https://github.com/sverrirs/jekyll-paginate-v2\">GitHub repo</a> to learn how to get the most out of this new pagination gem. There we also discuss the gems more advanced features.</p>\n\n<p>Please file all bugs/feature requests in the issues section of the <a href=\"https://github.com/sverrirs/jekyll-paginate-v2/issues\">GitHub repo</a>.</p>\n\n<p>Have a great day :)</p>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/feature/2020/07/07/Thearitical-images-of-the-tombstone/\" rel=\"nofollow\">The thearitical fortunes of African rich and famous families and its cost on the growth and well being of society</a> was originally published on Nwangele Post.</p>",
        "content_text": "You’ll find this post in your _posts directory. This post along with all of the other example posts is paginated by the new jekyll-paginate-v2 gem. This pagination gem is built specially for Jekyll 3 and newer and is intended to replace the now discontinuted jekyll-paginate gem. This v2 of the gem offers full backwards compatibility with the old gem and its site configuration. You can simply replace the old jekyll-paginate gem with this one and your sites will still work without any changes. However to access the new enhanced features of this gem, like pagination on categories, tags and locales, then you need to remove the old jekyll-paginate configuration and activate the new pagination: site configuration. The source code for this example project will show you all the necessary steps. Installing Go ahead and install the latest version of the gem from rubygems.org gem install jekyll-paginate-v2 Replace the jekyll-paginate gem with jekyll-paginate-v2 in both your _config.yml and your Gemfile. Now go ahead and re-build your site to start running the new pagination logic. You can rebuild the site in many different ways, but the most common way is to run jekyll serve, which launches a web server and auto-regenerates your site when a file is updated. Please see the GitHub repo to learn how to get the most out of this new pagination gem. There we also discuss the gems more advanced features. Please file all bugs/feature requests in the issues section of the GitHub repo. Have a great day :)"
        
          , "summary": "You’ll find this post in your _posts directory. This post along with all of the other example posts is paginated by the new jekyll-paginate-v2 gem."
        
        
        
        
          
          , "tags": ["Family","Gambit","Money"]
        
        , "date_published": "2020-07-07T18:16:49+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Onyeka Ngozi"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/feature/2020/06/27/career-opportunities",
        "url": "https//test-np.netlify.app/np-site/feature/2020/06/27/career-opportunities/",
        
        "title": "How to get better Career Opportunities",
        
        "content_html": "<p>My internship with Wikimedia is gradually coming to an end and I must say it’s been a life changing experience for me. I’m really amazed at what I’ve been able to achieve within this short period of time with the help of the community and guidance from my mentor.</p>\n\n<h3 id=\"looking-for-a-job-internship-a-grant-a-volunteer-position-or-some-type-of-other-opportunity-\">Looking for a job, internship, a grant, a volunteer position, or some type of other opportunity ?</h3>\n\n<p>I’m currently looking for full/part time job opportunities that will help me build a career in software development and also be able to improve developer experience. These opportunities could be remote and non-remote. Working remotely with Wikimedia has given some experience working remotely with a team and I must say, I enjoyed the flexibility that came with it. I am also open to relocating, if the need arises.</p>\n\n<h3 id=\"types-of-work-i-would-love-to-contribute-to--skills-that-would-help-me-wiith-such-work-\">Types of work I would love to contribute to / skills that would help me wiith such work ?</h3>\n\n<p>I would love to contribute to projects that involve software development, improving developer experience, technical writing and documentation.</p>\n\n<p>During my internship with Wikimedia, I worked on documentation improvements to most viewed MediaWiki Action API pages on-wiki, this project had me testing mediawiki action APIs with different scenerios and writing sample codes in different programming languages to come up with concise API documentations for these APIs. My drive for this project was majorly knowing the fact that while working on the API documentation, I was helping in my own little way, to improve the experience of developers making use of those APIs. My technical writing skills have improved from writing technical documentations, to blog posts and reports, I have more experience in building developer friendly APIs and writing Clean Code. Having to work remotely with a community using a collaboration tool called <a href=\"https://www.phacility.com/\">phabricator</a> has also improved my communication skills.</p>\n\n<p>Before my internship with Wikimedia, I went through a <a href=\"https://medium.com/interswitch-engineering-blog/introducing-the-1st-cohort-of-interswitchs-developer-academy-8569fda1bd21\">Developer Academy Program</a> hosted by <a href=\"https://www.interswitchgroup.com/\">Interswitch Nigeria LTD</a> (a digital payments and commerce company in Nigeria). This program lasted for 8 months where I went through series of training in Software Development, particularly building Enterprise Applications.\nThe first four months comprised of indepth classroom training on courses such as algorithms and data structures, design patterns, springboot and .net frameworks, quality assurance and software testing, and legacy systems etc. Followed by one month practical project where I built a Voucher microservice application using Java (<a href=\"https://spring.io/projects/spring-boot\">Spring boot</a>), C#(<a href=\"https://docs.microsoft.com/en-us/dotnet/core\">.NET Core</a>), <a href=\"https://docs.microsoft.com/en-us/dotnet/core\">Mongodb</a> and other tools and finally 3 months internship working with a team.</p>\n\n<p>During my three months internship, I worked with the developer relations team where I worked on series of tasks which include software development, technical writing, documentation, research, carrying out surveys and onboarding programs for new engineers.</p>\n\n<p>These internships have helped me build technical skills in software development, technical writing, developer relations, and soft skills in communication, being a team player, using collaboration tools and working remotely.</p>\n\n<h3 id=\"tools-or-skills-would-you-like-to-learn\">Tools or skills would you like to learn?</h3>\n\n<p>I would love to learn and explore software testing and devOps.</p>\n\n<h3 id=\"interpersonal-skills-that-make-me-a-collaborative-team-member-\">Interpersonal skills that make me a collaborative team member ?</h3>\n\n<p>I respect every member of my team(junior and senior), their opinions and their views. I am open to new ideas and believe in creativity. Having to work within a community and with a mentor during my internship also improved my communication skills. The project also helped improved my ability to connect with people through writing articles and blogposts.</p>\n\n<p>To summarize it all up, I have learnt alot while working with the mediawiki team and I intend to keep improving myself even after the internship. I’m really excited about moving on to the next phase of my career and seeking opportunities that will expand my knowledge and skills. Considering the knowledge gained and skills acquired from this internship and previous experiences, I am convinced that I’ll be a valuable employee to any company that’s lucky to have me. Cheers.</p>\n\n\n          <p><a href=\"https//test-np.netlify.app/np-site/feature/2020/06/27/career-opportunities/\" rel=\"nofollow\">How to get better Career Opportunities</a> was originally published on Nwangele Post.</p>",
        "content_text": "My internship with Wikimedia is gradually coming to an end and I must say it’s been a life changing experience for me. I’m really amazed at what I’ve been able to achieve within this short period of time with the help of the community and guidance from my mentor. Looking for a job, internship, a grant, a volunteer position, or some type of other opportunity ? I’m currently looking for full/part time job opportunities that will help me build a career in software development and also be able to improve developer experience. These opportunities could be remote and non-remote. Working remotely with Wikimedia has given some experience working remotely with a team and I must say, I enjoyed the flexibility that came with it. I am also open to relocating, if the need arises. Types of work I would love to contribute to / skills that would help me wiith such work ? I would love to contribute to projects that involve software development, improving developer experience, technical writing and documentation. During my internship with Wikimedia, I worked on documentation improvements to most viewed MediaWiki Action API pages on-wiki, this project had me testing mediawiki action APIs with different scenerios and writing sample codes in different programming languages to come up with concise API documentations for these APIs. My drive for this project was majorly knowing the fact that while working on the API documentation, I was helping in my own little way, to improve the experience of developers making use of those APIs. My technical writing skills have improved from writing technical documentations, to blog posts and reports, I have more experience in building developer friendly APIs and writing Clean Code. Having to work remotely with a community using a collaboration tool called phabricator has also improved my communication skills. Before my internship with Wikimedia, I went through a Developer Academy Program hosted by Interswitch Nigeria LTD (a digital payments and commerce company in Nigeria). This program lasted for 8 months where I went through series of training in Software Development, particularly building Enterprise Applications. The first four months comprised of indepth classroom training on courses such as algorithms and data structures, design patterns, springboot and .net frameworks, quality assurance and software testing, and legacy systems etc. Followed by one month practical project where I built a Voucher microservice application using Java (Spring boot), C#(.NET Core), Mongodb and other tools and finally 3 months internship working with a team. During my three months internship, I worked with the developer relations team where I worked on series of tasks which include software development, technical writing, documentation, research, carrying out surveys and onboarding programs for new engineers. These internships have helped me build technical skills in software development, technical writing, developer relations, and soft skills in communication, being a team player, using collaboration tools and working remotely. Tools or skills would you like to learn? I would love to learn and explore software testing and devOps. Interpersonal skills that make me a collaborative team member ? I respect every member of my team(junior and senior), their opinions and their views. I am open to new ideas and believe in creativity. Having to work within a community and with a mentor during my internship also improved my communication skills. The project also helped improved my ability to connect with people through writing articles and blogposts. To summarize it all up, I have learnt alot while working with the mediawiki team and I intend to keep improving myself even after the internship. I’m really excited about moving on to the next phase of my career and seeking opportunities that will expand my knowledge and skills. Considering the knowledge gained and skills acquired from this internship and previous experiences, I am convinced that I’ll be a valuable employee to any company that’s lucky to have me. Cheers."
        
          , "summary": "My internship with Wikimedia is gradually coming to an end and I must say it’s been a life changing experience for me. I’m really amazed at what I’ve been able to achieve within this short period of time with the help of the community and guidance from my mentor."
        
        
        
        
          
          , "tags": ["Carreers","Outreachy Internship"]
        
        , "date_published": "2020-06-27T18:16:49+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Julius Amadi"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/feature/2020/06/27/modifying-expectations",
        "url": "https//test-np.netlify.app/np-site/feature/2020/06/27/modifying-expectations/",
        
        "title": "Modifying Your Expectations: How not to loose sleep.",
        
        "content_html": "<p>Contributing to mediawiki has been an amazing journey for me so far. My project was initially divided into two sections, the first part was to improve 20 top 100 most viewed MediaWiki Action API pages on-wiki which was to last 8 weeks starting from the 3rd of December when the internship officially kicked off while the second part of the project was to develop a bot that mass edits sample code from mediaWiki-api-demos repository to the API namespace on MediaWiki.org and vice-versa and this was estimated to take 4 weeks. A couple of timelines and tasks have changed due to un-forseen circumstances and some tasks taking longer than anticipated but in all I’m excited about all I’ve been able to contribute so far and the knowledge gained while doing so.</p>\n\n<h2 id=\"goals-and-accomplishments-so-far\">Goals and Accomplishments So far</h2>\n\n<p>So far I’ve been able to improve 14 Mediawiki Action API pages and submit pull requests for Sample codes in Python, Javascript, PHP, and MediawikiJS for each of these pages. Links to Mediawiki action pages I’ve worked on and Pull requests can be found on my Mediawiki user page <a href=\"https://www.mediawiki.org/wiki/User:Zaycodes\">Zaycodes</a></p>\n\n<h2 id=\"what-project-goals-took-longer-than-expected-and-why\">What project goals took longer than expected and Why?</h2>\n\n<p>Improving the Mediawiki action API pages took longer than expected and this happened because I under-estimated the amount of work to be done. During the contribution phase I improved 2 pages, working on these pages was not so tedious for me because there was already some information on the existing page that I could work with and also guide me through testing the APIs so I assumed that the remaining pages were going to be the same, however I was wrong. During the community bonding period when I was putting together pages that I was going to improve, I discovered that some pages had little or no information to work with, so I had to do more research on these pages and test the APIs thoroughly so I could document all possible scenerios. such pages ended up taking longer time to work on than the estimated time. Lastly, <a href=\"https://zaycodes.github.io/outreachy-everybody-struggles/\">everyone struggles</a>, therefore i’ve also had some challenges such as git which also caused some delay.</p>\n\n<h2 id=\"what-would-you-do-differently-if-you-were-starting-the-project-over\">What would you do differently if you were starting the project over?</h2>\n\n<p>I would definitely do more research on the work that’s to be done before submiting my timelines, I would not just assume and under-estimate tasks especially when I have to work with tools I’ve not used before. I would also ask more questions when I’m not sure about tasks before making time commitments.</p>\n\n<h2 id=\"which-original-goals-needed-to-be-modified\">Which original goals needed to be modified?</h2>\n\n<p>The second part of my project to develop a bot that mass edits sample code from mediaWiki-api-demos repository to the API namespace on MediaWiki.org and vice-versa was replaced with improving additional Mediawiki action pages instead.</p>\n\n<h2 id=\"my-new-plan-for-the-second-half-of-the-internship\">My new plan for the second half of the internship?</h2>\n\n<p>To improve as many Mediawiki action pages as I can, I’m more used to the tools and environment than I was when I started so I believe I’ll be able to work on more pages in the second half of the internship all things being equal.</p>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/feature/2020/06/27/modifying-expectations/\" rel=\"nofollow\">Modifying Your Expectations: How not to loose sleep.</a> was originally published on Nwangele Post.</p>",
        "content_text": "Contributing to mediawiki has been an amazing journey for me so far. My project was initially divided into two sections, the first part was to improve 20 top 100 most viewed MediaWiki Action API pages on-wiki which was to last 8 weeks starting from the 3rd of December when the internship officially kicked off while the second part of the project was to develop a bot that mass edits sample code from mediaWiki-api-demos repository to the API namespace on MediaWiki.org and vice-versa and this was estimated to take 4 weeks. A couple of timelines and tasks have changed due to un-forseen circumstances and some tasks taking longer than anticipated but in all I’m excited about all I’ve been able to contribute so far and the knowledge gained while doing so. Goals and Accomplishments So far So far I’ve been able to improve 14 Mediawiki Action API pages and submit pull requests for Sample codes in Python, Javascript, PHP, and MediawikiJS for each of these pages. Links to Mediawiki action pages I’ve worked on and Pull requests can be found on my Mediawiki user page Zaycodes What project goals took longer than expected and Why? Improving the Mediawiki action API pages took longer than expected and this happened because I under-estimated the amount of work to be done. During the contribution phase I improved 2 pages, working on these pages was not so tedious for me because there was already some information on the existing page that I could work with and also guide me through testing the APIs so I assumed that the remaining pages were going to be the same, however I was wrong. During the community bonding period when I was putting together pages that I was going to improve, I discovered that some pages had little or no information to work with, so I had to do more research on these pages and test the APIs thoroughly so I could document all possible scenerios. such pages ended up taking longer time to work on than the estimated time. Lastly, everyone struggles, therefore i’ve also had some challenges such as git which also caused some delay. What would you do differently if you were starting the project over? I would definitely do more research on the work that’s to be done before submiting my timelines, I would not just assume and under-estimate tasks especially when I have to work with tools I’ve not used before. I would also ask more questions when I’m not sure about tasks before making time commitments. Which original goals needed to be modified? The second part of my project to develop a bot that mass edits sample code from mediaWiki-api-demos repository to the API namespace on MediaWiki.org and vice-versa was replaced with improving additional Mediawiki action pages instead. My new plan for the second half of the internship? To improve as many Mediawiki action pages as I can, I’m more used to the tools and environment than I was when I started so I believe I’ll be able to work on more pages in the second half of the internship all things being equal."
        
          , "summary": "Contributing to mediawiki has been an amazing journey for me so far. My project was initially divided into two sections, the first part was to improve 20 top 100 most viewed MediaWiki Action API pages on-wiki which was to last 8 weeks starting from the 3rd of December when the internship officially kicked off while the second part of the project was to develop a bot that mass edits sample code from mediaWiki-api-demos repository to the API namespace on MediaWiki.org and vice-versa and this was estimated to take 4 weeks. A couple of timelines and tasks have changed due to un-forseen circumstances and some tasks taking longer than anticipated but in all I’m excited about all I’ve been able to contribute so far and the knowledge gained while doing so."
        
        
        
        
          
          , "tags": ["Carreers","Job Hunting","MediaWiki"]
        
        , "date_published": "2020-06-27T18:16:49+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Chris Gomes"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/06/27/Welcome-to-Nwangele-Post",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/06/27/Welcome-to-Nwangele-Post/",
        
        "title": "My Experience Applying to Outreachy",
        
        "content_html": "<p>Outreachy is an internship program that helps women and people who are under-represented get more invloved with open source through remote internships. Outreachy provides a supportive community for beginning to contribute any time throughout the year and offer focused internship opportunities twice a year with a number of free software organizations.</p>\n\n<h2 id=\"the-application-process\">The Application Process</h2>\n\n<p>When I first heard of outreachy I was skeptical because I had very little experience in open source. I decided to do some research. After series of research on outreachy and reading the reports and success stories of ex-interns, I was convinced within me that this was the breakthrough I needed to break out of my shell and get more involved in open source.</p>\n\n<p>So I subscribed to Outreachy’s mailing list to get a notification when applications would open and started getting more involved in open source contributions as I was really motivated by all the success stories I had read at this point.</p>\n\n<p>Fastforward few weeks later I submitted my initial application and was ecstatic when it was approved. This took me to the the second phase which is the contribution phase.</p>\n\n<h3 id=\"contribution-phase\">Contribution Phase</h3>\n\n<h4 id=\"selecting-a-project\">Selecting a Project</h4>\n\n<p>The contribution phase kicked off on 1st of October and lasted for about a month. It came with the dilemma of selecting a project from the numerous list of projects to contribute to. I wanted to make contributions to at least two different projects to increase my chances of getting selected. I went through all the projects and read their descriptions and required skill set to find a project that matches my skillset and where I knew I could make a difference. I was happy when I came across Mediawiki’s project <code class=\"highlighter-rouge\">Documentation improvements to the ~20 top 100 most viewed MediaWiki Action API pages on-wiki</code>. Wikipedia has always been a primary source of content when carrying out any research for me, from solving school assignments to undergraduate thesis, to post-graduate studies, my software-development career and even getting information on the fly. Though I hadn’t contributed to wikimedia before, although I have worked on improving documentation for an organization before and managed their engineering blog, I decided to take a leap of faith by applying with the mindset that even if I didn’t get accepted, I will have the opportunity to contribute to improving the experience of thousands of developers who utilize Mediawiki’s API and be able to give back to the community that has helped me by so doing. So with that mindset, I chose wikimedia and my contribution phase began.</p>\n\n<h3 id=\"contributing\">Contributing</h3>\n\n<p>After selecting my choice project, I went through all the available resources, registered on the communication platform which was zulip, created a phabricator account and a mediawiki account. I introduced myself on <code class=\"highlighter-rouge\">zulip</code> -MediaWiki’s communication channel- to other members and also to the mentor assigned to me (Brenda Jerop).</p>\n\n<p>Then came the time to actually put in some work. A phabricator page was created for us (applicants) with a list of micro-tasks to work on. Things like API documentation page improvement were included in the tasks. I picked my first task which became my first contribution and started working on it. To be honest it was all overwhelming at first as most of the technologies were a bit new to me. But then there was something very important I learnt from this phase, which is fact that <code class=\"highlighter-rouge\">communication</code> is key. I asked my mentor for guidance whenever I got stuck or was confused coupled with the fact that mediawiki had a lot of resources to help including blog posts and reports of past interns, all you had to do was just look.</p>\n\n<p>I was so excited when I created my first pull request but even more ecstatic when it was merged. I was able to submit three pull requests during the contribution period with one work in progress. Somewhere in between contributions, I drafted out my final application and submitted it to my mentor to review. Then I submitted on outreachy.</p>\n\n<p>One great advice I got for this contribution phase, which I’m happy I took was to start contributing early. At first it might seem like you have enough time but depending on the organization and project you are working on and how familiar you are with their process, you might need some time to understand the tools and process. For me, even though I had worked on similar projects outside wikimedia, I hadn’t contributed to wikimedia before and their processes and tools were slightly different, so starting early gave me enough room to get used to all these.</p>\n\n<h2 id=\"getting-selected-as-an-outreachy-wikimedia-intern\">Getting Selected as an Outreachy Wikimedia Intern</h2>\n\n<p>On the 26th of November 2019, I got the most exciting news that I had been selected as an Outreachy intern for Wikimedia. I was excited that I didn’t give up before I even started simply because I thought it wasn’t for me. So I will be working on the project: Documentation improvements to the ~20 top 100 most viewed MediaWiki Action API pages on-wiki.</p>\n\n<p>I’m really excited to be working for Wikimedia, it feels like a dream come through and I also look forward to working with my mentor and the Wikimedia community to be able to contribute my own little quota to this wonderful foundation.</p>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/06/27/Welcome-to-Nwangele-Post/\" rel=\"nofollow\">My Experience Applying to Outreachy</a> was originally published on Nwangele Post.</p>",
        "content_text": "Outreachy is an internship program that helps women and people who are under-represented get more invloved with open source through remote internships. Outreachy provides a supportive community for beginning to contribute any time throughout the year and offer focused internship opportunities twice a year with a number of free software organizations. The Application Process When I first heard of outreachy I was skeptical because I had very little experience in open source. I decided to do some research. After series of research on outreachy and reading the reports and success stories of ex-interns, I was convinced within me that this was the breakthrough I needed to break out of my shell and get more involved in open source. So I subscribed to Outreachy’s mailing list to get a notification when applications would open and started getting more involved in open source contributions as I was really motivated by all the success stories I had read at this point. Fastforward few weeks later I submitted my initial application and was ecstatic when it was approved. This took me to the the second phase which is the contribution phase. Contribution Phase Selecting a Project The contribution phase kicked off on 1st of October and lasted for about a month. It came with the dilemma of selecting a project from the numerous list of projects to contribute to. I wanted to make contributions to at least two different projects to increase my chances of getting selected. I went through all the projects and read their descriptions and required skill set to find a project that matches my skillset and where I knew I could make a difference. I was happy when I came across Mediawiki’s project Documentation improvements to the ~20 top 100 most viewed MediaWiki Action API pages on-wiki. Wikipedia has always been a primary source of content when carrying out any research for me, from solving school assignments to undergraduate thesis, to post-graduate studies, my software-development career and even getting information on the fly. Though I hadn’t contributed to wikimedia before, although I have worked on improving documentation for an organization before and managed their engineering blog, I decided to take a leap of faith by applying with the mindset that even if I didn’t get accepted, I will have the opportunity to contribute to improving the experience of thousands of developers who utilize Mediawiki’s API and be able to give back to the community that has helped me by so doing. So with that mindset, I chose wikimedia and my contribution phase began. Contributing After selecting my choice project, I went through all the available resources, registered on the communication platform which was zulip, created a phabricator account and a mediawiki account. I introduced myself on zulip -MediaWiki’s communication channel- to other members and also to the mentor assigned to me (Brenda Jerop). Then came the time to actually put in some work. A phabricator page was created for us (applicants) with a list of micro-tasks to work on. Things like API documentation page improvement were included in the tasks. I picked my first task which became my first contribution and started working on it. To be honest it was all overwhelming at first as most of the technologies were a bit new to me. But then there was something very important I learnt from this phase, which is fact that communication is key. I asked my mentor for guidance whenever I got stuck or was confused coupled with the fact that mediawiki had a lot of resources to help including blog posts and reports of past interns, all you had to do was just look. I was so excited when I created my first pull request but even more ecstatic when it was merged. I was able to submit three pull requests during the contribution period with one work in progress. Somewhere in between contributions, I drafted out my final application and submitted it to my mentor to review. Then I submitted on outreachy. One great advice I got for this contribution phase, which I’m happy I took was to start contributing early. At first it might seem like you have enough time but depending on the organization and project you are working on and how familiar you are with their process, you might need some time to understand the tools and process. For me, even though I had worked on similar projects outside wikimedia, I hadn’t contributed to wikimedia before and their processes and tools were slightly different, so starting early gave me enough room to get used to all these. Getting Selected as an Outreachy Wikimedia Intern On the 26th of November 2019, I got the most exciting news that I had been selected as an Outreachy intern for Wikimedia. I was excited that I didn’t give up before I even started simply because I thought it wasn’t for me. So I will be working on the project: Documentation improvements to the ~20 top 100 most viewed MediaWiki Action API pages on-wiki. I’m really excited to be working for Wikimedia, it feels like a dream come through and I also look forward to working with my mentor and the Wikimedia community to be able to contribute my own little quota to this wonderful foundation."
        
          , "summary": "Outreachy is an internship program that helps women and people who are under-represented get more invloved with open source through remote internships. Outreachy provides a supportive community for beginning to contribute any time throughout the year and offer focused internship opportunities twice a year with a number of free software organizations."
        
        
        
        
          
          , "tags": ["Internship","Outreachy Internship","Tech"]
        
        , "date_published": "2020-06-27T09:00:00+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Onyeka Chris"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/06/03/52",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/06/03/52/",
        
        "title": "Ascendendant Danish People’s Party Finds No Sympathy for Harassed Danish, Muslim Women",
        
        "content_html": "<p>In <a href=\"http://www.microsofttranslator.com/bv.aspx?from=da&amp;to=en&amp;a=http%3A%2F%2Fpolitiken.dk%2Fdebat%2Fdebatindlaeg%2FECE2340214%2Fjeg-er-blevet-overfaldet-og-svinet-til-paa-grund-af-mit-toerklaede%2F\">a letter</a> published in the Danish newspaper <i>Politiken</i> on July 11th, <strong>Aya Baram</strong> shares her experience of living in Denmark for sixteen years as a Muslim woman who wears a headscarf.</p>\n\n<p>An excerpt of her experiences reads:</p>\n\n<blockquote>\n  <p>I have been punched on the street, after which I’ve been told to “take my f… scarf of”. The police wouldn’t even press charges, because my husband was my only witness. I have witnessed an entire bus yelling that they would vote for the Danish People’s Party and get the Muslims out of the country, because a girl with a scarf happened to hold the seat in front of her, when the bus turned, whereby she touched another girl’s hair.</p>\n\n  <p>I have had a guy suddenly let loose on my then-three-months-old nephew’s stroller with punches and kicks, after which another guy abused my sister with words like “terrorists” and other choice words, spat her in the face at a packed Nørreport [Train] Station, while everyone watched without helping.</p>\n\n  <p>The only remark we got was from a couple who told my crying sister “but they didn’t mean it personally”.</p>\n</blockquote>\n\n<p>The crux of her article beyond sharing her stories from living sixteen years as a Muslim in Denmark is to encourage Muslim women to speak up for themselves, and not let others speak on their behalf.</p>\n\n<p>The full translation of her letter can be read <a href=\"https://gist.github.com/ndarville/0b7d56cdcb4620ecb6ad\">here</a>.</p>\n\n<p>After Baram’s letter, <i>Politiken</i> went on to do a <a href=\"http://www.microsofttranslator.com/bv.aspx?from=da&amp;to=en&amp;a=http%3A%2F%2Fpolitiken.dk%2Findland%2FECE2340586%2Fkvinder-chikaneres-paa-grund-af-deres-toerklaede%2F\">follow-up article</a>.</p>\n\n<h3 id=\"the-danish-peoples-party-responds\">The Danish People’s Party Responds</h3>\n\n<p>Not one to pass on an Islam-related discussion, <strong>Pia Kjærsgaard</strong> from the—aforementioned—<strong>Danish People’s Party</strong> (DPP) chimed in with an entry on her blog<sup id=\"fnref:tv2-blog\"><a href=\"#fn:tv2-blog\" class=\"footnote\">1</a></sup>.</p>\n\n<p>But before we get to her comments, some background on Kjærsgaard and her party in the context of Danish politics today.</p>\n\n<h4 id=\"todays-danish-peoples-party\">Today’s Danish People’s Party</h4>\n\n<p>The nationalistic DPP is no niche party nor a group of people riding a political wave; the party is currently <a href=\"https://en.wikipedia.org/w/index.php?title=Opinion_polling_for_the_next_Danish_general_election&amp;oldid=616777716\">trailing the two largest coalition parties</a>, polling in the low 20s, compared to the 12.3% it managed at the last election.</p>\n\n<p>It has never polled higher, since it was founded in 1995 by Pia Kjærsgaard and entered parliament in 1998. Kjærsgaard was the party leader, until 2012, when she passed the torch to <strong>Kristian Thulesen Dahl</strong>. She then relegated herself to the position of the party’s <em>spokesperson on values</em>.</p>\n\n<p>Recently, the euroskeptic party emerged victorious in the election to the European Parliament, where they doubled their MEP seats from two to four with 26.6 per cent of the vote, sweeping the nation as the biggest party in the election.</p>\n\n<p>The DPP are currently in the opposition to the incumbent government, but an impending change of administration seems a done deal in light of how the opposition has lead in <em><a href=\"https://en.wikipedia.org/w/index.php?title=Opinion_polling_for_the_next_Danish_general_election&amp;oldid=616777716\">every single poll</a> since the last election</em> in September 2012, aside from one intermittent bump in the road in May–June that soon petered out.</p>\n\n<p>Said bump, a scandal surrounding <strong>Lars Løkke Rasmussen</strong>, the leader of the opposition’s biggest party, <strong>Venstre</strong>, has suddenly eroded Venstre’s dominance in polls and levelled the playing field between the party and the DPP.</p>\n\n<p>The Danish People’s Party are no longer in a position of tipping the balance of power in Denmark; they now are contenders for claiming it for themselves.</p>\n\n<h4 id=\"pia-kjærsgaards-blog-entry\">Pia Kjærsgaard’s Blog Entry</h4>\n\n<p>Returning to Kjærsgaard’s <a href=\"http://www.microsofttranslator.com/bv.aspx?from=da&amp;to=en&amp;a=http%3A%2F%2Fpolitik.tv2.dk%2F2014-07-14-jeg-f%25C3%25B8ler-mig-provokeret\">entry</a> in which she does not mince words on her position on the plight of Danish Muslim women.</p>\n\n<p>She begins</p>\n\n<blockquote>\n  <p>This Friday, [Danish newspaper] Politiken reported how Muslim women who wear headscarves felt overwhelmingly subjected to persecution, rudeness, and jeers on the street. I personally have never experienced such a thing, nor have I ever heard anyone talk about it, so perhaps the extent has been slightly exaggerated. I generally know the Danes as a well-mannered people, who, even though they do not feel great sympathy for the Muslim headscarf, naturally will not resort to foul language against the wearers of the headscarf.</p>\n\n  <p>Those Muslim women feel provoked by the reaction their headscarves elicit. I feel provoked, too. By them and their choice of the scarf over the Danish society!</p>\n</blockquote>\n\n<p>And no ground is ceded in the discussion over headscarves, as Kjærsgaard ends her entry:</p>\n\n<blockquote>\n  <p>Fact is that the scarf in all its variants is a symbol of Islamic fundamentalism and a declaration of war against women’s right to equal right and equal value. Thus, there is every reason to criticize the headscarf. Muslim women who choose the scarf must therefore not expect to smoke peace pipe with me. On the contrary. When you choose to distance yourself from the Danish society, you must also come to expect that the Danish society distances itself from your choice. This is how it is.</p>\n</blockquote>\n\n<p>Read the entire entry translated <a href=\"https://gist.github.com/ndarville/e2205ee779ef5962057e\">here</a>.</p>\n\n<h3 id=\"kjærsgaard-interviewed\">Kjærsgaard Interviewed</h3>\n\n<p><i>Politiken</i> got a hold of Kjærsgaard for an <a href=\"http://www.microsofttranslator.com/bv.aspx?from=da&amp;to=en&amp;a=http%3A%2F%2Fpolitiken.dk%2Fdebat%2FECE2343459%2Fjeg-foeler-mig-provokeret-af-kvinder-med-toerklaede%2F\">interview</a>. In it, they pressed her for a response to the actual subject of violence raised by Aya Baram, which Kjærsgaard had glossed over in her diatribe against the Muslim headscarf.</p>\n\n<p>When interviewed, Kjærsgaard continues to express empathy for the people reacting to the women in public.</p>\n\n<blockquote>\n  <p><strong>Interviewer:</strong> In a debate concerning violence against women with [head]scarves, shouldn’t you address the violence, which <em>is</em> the central topic?</p>\n\n  <p><strong>Kjærsgaard:</strong> Just because I haven’t written in bold type that I abhor violence, it doesn’t mean that I support it. I am writing that I feel provoked by women with scarves. That others feel provoked by these women I can understand. That they have been subjected to comments, I can understand just fine.</p>\n</blockquote>\n\n<p>And in closing, Kjærsgaard is unwaivering in doubling down on blaming the victims.</p>\n\n<blockquote>\n  <p><strong>Interviewer:</strong> You must be a victim, when you as an innocent person are subjected to violence?</p>\n\n  <p><strong>Kjærsgaard:</strong> Yes, but women with scarves could also just think through the situation; if they keep getting those reactions on the street, they could just take off the scarf. Then they would also signal that they want to be a part of the Danish society.</p>\n</blockquote>\n\n<p>Read <a href=\"https://gist.github.com/ndarville/ceebac30db5399f77287\">the full interview</a>.</p>\n\n<h3 id=\"further-reading\">Further Reading</h3>\n\n<ul>\n  <li>\n    <p>Kjærsgaard decries public intolerance and harassment by Muslims in <a href=\"http://www.danskfolkeparti.dk/Giv_os_N%C3%B8rrebro_tilbage...\">her weekly party newsletter from November 24 2003</a>.</p>\n\n    <blockquote>\n      <p>In the interim, we back home will work to get back [the capital district] Nørrebro.</p>\n\n      <p>So that once again, tolerance and free-mindedness can come to the north of Dronning Louise’s Bridge.</p>\n    </blockquote>\n  </li>\n  <li>\n    <p><a href=\"http://fra.europa.eu/en/publication/2014/vaw-survey-main-results\">2014 report</a> by the European Agency for Fundamental Rights on violence againt women.</p>\n  </li>\n</ul>\n\n<h3 id=\"article-links\">Article Links</h3>\n\n<ol>\n  <li><a href=\"http://www.microsofttranslator.com/bv.aspx?from=da&amp;to=en&amp;a=http%3A%2F%2Fpolitiken.dk%2Fdebat%2Fdebatindlaeg%2FECE2340214%2Fjeg-er-blevet-overfaldet-og-svinet-til-paa-grund-af-mit-toerklaede%2F\">Aya Baram’s letter to <i>Politiken</i></a> (<a href=\"https://gist.github.com/ndarville/0b7d56cdcb4620ecb6ad\">full translation</a>)</li>\n  <li><a href=\"http://www.microsofttranslator.com/bv.aspx?from=da&amp;to=en&amp;a=http%3A%2F%2Fpolitiken.dk%2Findland%2FECE2340586%2Fkvinder-chikaneres-paa-grund-af-deres-toerklaede%2F\"><i>Politiken’s</i> follow-up article</a></li>\n  <li><a href=\"http://www.microsofttranslator.com/bv.aspx?from=da&amp;to=en&amp;a=http%3A%2F%2Fpolitik.tv2.dk%2F2014-07-14-jeg-f%25C3%25B8ler-mig-provokeret\">Pia Kjærsgaard’s blog entry</a> (<a href=\"https://gist.github.com/ndarville/e2205ee779ef5962057e\">full translation</a>)</li>\n  <li><a href=\"http://www.microsofttranslator.com/bv.aspx?from=da&amp;to=en&amp;a=http%3A%2F%2Fpolitiken.dk%2Fdebat%2FECE2343459%2Fjeg-foeler-mig-provokeret-af-kvinder-med-toerklaede%2F\">Interview with Pia Kjærsgaard</a> (<a href=\"https://gist.github.com/ndarville/ceebac30db5399f77287\">full translation</a>)</li>\n</ol>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:tv2-blog\">\n      <p>Pia Kjærsgaard’s blog is hosted by Danish TV network TV 2 on tv2.dk—not privately nor by her party. <a href=\"#fnref:tv2-blog\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/06/03/52/\" rel=\"nofollow\">Ascendendant Danish People's Party Finds No Sympathy for Harassed Danish, Muslim Women</a> was originally published on Nwangele Post.</p>",
        "content_text": "In a letter published in the Danish newspaper Politiken on July 11th, Aya Baram shares her experience of living in Denmark for sixteen years as a Muslim woman who wears a headscarf. An excerpt of her experiences reads: I have been punched on the street, after which I’ve been told to “take my f… scarf of”. The police wouldn’t even press charges, because my husband was my only witness. I have witnessed an entire bus yelling that they would vote for the Danish People’s Party and get the Muslims out of the country, because a girl with a scarf happened to hold the seat in front of her, when the bus turned, whereby she touched another girl’s hair. I have had a guy suddenly let loose on my then-three-months-old nephew’s stroller with punches and kicks, after which another guy abused my sister with words like “terrorists” and other choice words, spat her in the face at a packed Nørreport [Train] Station, while everyone watched without helping. The only remark we got was from a couple who told my crying sister “but they didn’t mean it personally”. The crux of her article beyond sharing her stories from living sixteen years as a Muslim in Denmark is to encourage Muslim women to speak up for themselves, and not let others speak on their behalf. The full translation of her letter can be read here. After Baram’s letter, Politiken went on to do a follow-up article. The Danish People’s Party Responds Not one to pass on an Islam-related discussion, Pia Kjærsgaard from the—aforementioned—Danish People’s Party (DPP) chimed in with an entry on her blog1. But before we get to her comments, some background on Kjærsgaard and her party in the context of Danish politics today. Today’s Danish People’s Party The nationalistic DPP is no niche party nor a group of people riding a political wave; the party is currently trailing the two largest coalition parties, polling in the low 20s, compared to the 12.3% it managed at the last election. It has never polled higher, since it was founded in 1995 by Pia Kjærsgaard and entered parliament in 1998. Kjærsgaard was the party leader, until 2012, when she passed the torch to Kristian Thulesen Dahl. She then relegated herself to the position of the party’s spokesperson on values. Recently, the euroskeptic party emerged victorious in the election to the European Parliament, where they doubled their MEP seats from two to four with 26.6 per cent of the vote, sweeping the nation as the biggest party in the election. The DPP are currently in the opposition to the incumbent government, but an impending change of administration seems a done deal in light of how the opposition has lead in every single poll since the last election in September 2012, aside from one intermittent bump in the road in May–June that soon petered out. Said bump, a scandal surrounding Lars Løkke Rasmussen, the leader of the opposition’s biggest party, Venstre, has suddenly eroded Venstre’s dominance in polls and levelled the playing field between the party and the DPP. The Danish People’s Party are no longer in a position of tipping the balance of power in Denmark; they now are contenders for claiming it for themselves. Pia Kjærsgaard’s Blog Entry Returning to Kjærsgaard’s entry in which she does not mince words on her position on the plight of Danish Muslim women. She begins This Friday, [Danish newspaper] Politiken reported how Muslim women who wear headscarves felt overwhelmingly subjected to persecution, rudeness, and jeers on the street. I personally have never experienced such a thing, nor have I ever heard anyone talk about it, so perhaps the extent has been slightly exaggerated. I generally know the Danes as a well-mannered people, who, even though they do not feel great sympathy for the Muslim headscarf, naturally will not resort to foul language against the wearers of the headscarf. Those Muslim women feel provoked by the reaction their headscarves elicit. I feel provoked, too. By them and their choice of the scarf over the Danish society! And no ground is ceded in the discussion over headscarves, as Kjærsgaard ends her entry: Fact is that the scarf in all its variants is a symbol of Islamic fundamentalism and a declaration of war against women’s right to equal right and equal value. Thus, there is every reason to criticize the headscarf. Muslim women who choose the scarf must therefore not expect to smoke peace pipe with me. On the contrary. When you choose to distance yourself from the Danish society, you must also come to expect that the Danish society distances itself from your choice. This is how it is. Read the entire entry translated here. Kjærsgaard Interviewed Politiken got a hold of Kjærsgaard for an interview. In it, they pressed her for a response to the actual subject of violence raised by Aya Baram, which Kjærsgaard had glossed over in her diatribe against the Muslim headscarf. When interviewed, Kjærsgaard continues to express empathy for the people reacting to the women in public. Interviewer: In a debate concerning violence against women with [head]scarves, shouldn’t you address the violence, which is the central topic? Kjærsgaard: Just because I haven’t written in bold type that I abhor violence, it doesn’t mean that I support it. I am writing that I feel provoked by women with scarves. That others feel provoked by these women I can understand. That they have been subjected to comments, I can understand just fine. And in closing, Kjærsgaard is unwaivering in doubling down on blaming the victims. Interviewer: You must be a victim, when you as an innocent person are subjected to violence? Kjærsgaard: Yes, but women with scarves could also just think through the situation; if they keep getting those reactions on the street, they could just take off the scarf. Then they would also signal that they want to be a part of the Danish society. Read the full interview. Further Reading Kjærsgaard decries public intolerance and harassment by Muslims in her weekly party newsletter from November 24 2003. In the interim, we back home will work to get back [the capital district] Nørrebro. So that once again, tolerance and free-mindedness can come to the north of Dronning Louise’s Bridge. 2014 report by the European Agency for Fundamental Rights on violence againt women. Article Links Aya Baram’s letter to Politiken (full translation) Politiken’s follow-up article Pia Kjærsgaard’s blog entry (full translation) Interview with Pia Kjærsgaard (full translation) Pia Kjærsgaard’s blog is hosted by Danish TV network TV 2 on tv2.dk—not privately nor by her party. &#8617;"
        
          , "summary": "In a letter published in the Danish newspaper Politiken on July 11th, Aya Baram shares her experience of living in Denmark for sixteen years as a Muslim woman who wears a headscarf."
        
        
        
        
          
          , "tags": ["CSS","Cosmos","Hafnia Posts"]
        
        , "date_published": "2020-06-03T18:16:49+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Julia Kehnkha"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/05/07/51",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/05/07/51/",
        
        "title": "Sexism at Danish Juice Bar Gets a Facebook Call-out",
        
        "content_html": "<p><strong>Lisa B. Nygaard</strong> got more than she ordered, when she took her two daughters to a <strong>Joe &amp; the Juice</strong> bar. She took to sharing her experience as an open letter <a href=\"https://www.facebook.com/lisabjort/posts/821727854512732\">on Facebook</a>:</p>\n\n<blockquote>\n  <p>I visited you in [the Fields mall] today along with my daughters. We might have been there for 30 minutes, but in the span of that half hour, we managed to listen in on a lot of exciting details pertaining to you and your colleagues’ private life.</p>\n\n  <p>We could hear how one of you had “done” an ugly girl in the weekend, because “the girlfriend was out travelling, which meant there was some serious [f—ing] to do”. Apparently, you won’t be as picky then, and even the ugly girls can “get a piece” of yours.</p>\n\n  <p>We could also follow how all girls entering were rated “totally nice”, “semi”, and “ok with the lights off” and other more and less flattering phrases.</p>\n\n  <p>Photos of the aforementioned ugly girl were shared, and I heard one of you show off with how you, when you’re out at night with your friends, feel awesome treating women “as crappy as possible”.</p>\n\n  <p>(…)<sup id=\"fnref:full\"><a href=\"#fn:full\" class=\"footnote\">1</a></sup></p>\n</blockquote>\n\n<h3 id=\"joe--the-juice\">Joe &amp; the Juice</h3>\n\n<p>Kaspar Basse founded the company in Denmark in 2002. It has become the biggest juice-bar chain in Denmark with affiliates in the U.K., Germany, Norway, Sweden, and Iceland. It was acquired in 2013 by Swedish private-equity group <a href=\"http://www.valedopartners.com/joe-and-the-juice-och-valedo.aspx\">Valedo Partners</a>.</p>\n\n<p>In the bars, customers lounge with their juices and sandwiches. All bars are heavily branded with an environment of loud music and noises, and a staff of fresh-faced men exuding a upbeat, chatty, and fratty demeanour. The branded culture is evident a menu featuring juices like <strong>“Joe’s Green Kiss”</strong>, <strong>“Sex Me Up”</strong>, and <strong>“Young Blood”</strong><sup id=\"fnref:menu\"><a href=\"#fn:menu\" class=\"footnote\">2</a></sup>.</p>\n\n<p>The Abercrombie &amp; Sandwich concept has been adopted by competing juice bars such as <a href=\"http://big-apple.dk\">Big Apple</a>.</p>\n\n<h3 id=\"the-reaction\">The Reaction</h3>\n\n<p>Nygaard’s Facebook post sparked a fiery discussion and quickly prompted coverage all over Danish media.<sup id=\"fnref:coverage\"><a href=\"#fn:coverage\" class=\"footnote\">3</a></sup></p>\n\n<p>Five hours after the original post, Joe &amp; the Juice responded in a hastily-scribbled Facebook comment. It was penned by <strong>Simon Nielsen</strong>, the company’s Academy Leader and Brand Police<sup id=\"fnref:simon-nielsen\"><a href=\"#fn:simon-nielsen\" class=\"footnote\">4</a></sup>. The statement reads<sup id=\"fnref:language\"><a href=\"#fn:language\" class=\"footnote\">5</a></sup>:</p>\n\n<blockquote>\n  <p>Hi Lisa</p>\n\n  <p>First of all, thanks for bringing this episode to our attention.</p>\n\n  <p>Since you wrote the post, I’ve been trying to get a hold of the employees, who worked that day, to deal with the matter. I have been in touch with the manager of the bar and the employees, and it will be dealt with immediately, as we find it completely unacceptable, and it is far away from our own values for such language to be used in a bar to talk about other people like that.</p>\n\n  <p>I am sorry that you and your daughters had to witness this, and I want to assure you it won’t happen again.</p>\n\n  <p>We hope that you will return, and arrangements will obviously be made for a better experience on the house.</p>\n\n  <p>Once again, many apologies on behalf of us and the boys … I’ll give them an earful, and hopefully, this will be a lesson to them. Kind regards, Simon Nielsen, Academy Leader - Joe &amp; the Juice.</p>\n</blockquote>\n\n<p>The exact consequences of the incident have yet to be specified.</p>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:full\">\n      <p>The rest of Nygaard’s Facebook post translated:</p>\n\n      <blockquote>\n        <p>It’s one thing that you ruined our meal completely with your completely ridiculous discussion of the wonderful sex, which you instead should hallow and respect, and that my girls, who still believe they’re worth as much as the boys in the kindergarten, had to listen to you rate and disrespect women in that vicious way. Another is that I assume that you all have moms, who’ve given birth to you, nursed you, and been the most important woman for the majority of your life, and if you’re lucky, you’ll have some beautiful daughters one da (when you grow up) . but try to consider what world you’ll release them into? A world full of boys like you.</p>\n\n        <p>I forgive you, because after all, you aren’t any older. And because you apparently are so insecure about yourselves, your sexuality, and your own worth that it’s the only way you can communicate with each other.</p>\n\n        <p>But I implore you to reconsider your conduct anyway - for your customers’ sake, for your own sake, and for your future daughters’ sake. There are so many people who think you are “awesome”, so what about making a difference and being a part of changing teenage boys’ perception of the opposite sex? Perhaps you can focus on respecting all the wonderful girls and women out there - and stop the hatred?</p>\n\n        <p>Kind regards, Lisa Björt Nygaard</p>\n      </blockquote>\n      <p><a href=\"#fnref:full\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:menu\">\n      <p>Sandwich names taken from the <a href=\"http://www.joejuice.com/site/#!menu\">website menu</a>; the juice names are respectively covered by ™, ®, and ®. <a href=\"#fnref:menu\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:coverage\">\n      <p>Coverage in <i><a href=\"http://ekstrabladet.dk/nyheder/samfund/article4943823.ece\">Ekstra Bladet</a></i>, <i><a href=\"http://www.bt.dk/danmark/mor-i-chok-over-joe-and-the-juice-hold-jeres-vamle-sex-historier-for-jer-selv\">BT</a></i>, <i><a href=\"http://nyhederne.tv2.dk/samfund/2014-07-30-lisa-k%C3%B8bte-juice-m%C3%A5tte-h%C3%B8re-p%C3%A5-personalets-sex-historier\">TV 2</a></i>. <a href=\"#fnref:coverage\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:simon-nielsen\">\n      <p>Nielsen’s job titles are in the parlance of his own <a href=\"https://www.linkedin.com/profile/view?id=61417382\">LinekdIn profile</a>. <a href=\"#fnref:simon-nielsen\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:language\">\n      <p>The informal nature of Nielsen’s comment, with errant spelling and punctuation, is not reflected in the translation. <a href=\"#fnref:language\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/05/07/51/\" rel=\"nofollow\">Sexism at Danish Juice Bar Gets a Facebook Call-out</a> was originally published on Nwangele Post.</p>",
        "content_text": "Lisa B. Nygaard got more than she ordered, when she took her two daughters to a Joe &amp; the Juice bar. She took to sharing her experience as an open letter on Facebook: I visited you in [the Fields mall] today along with my daughters. We might have been there for 30 minutes, but in the span of that half hour, we managed to listen in on a lot of exciting details pertaining to you and your colleagues’ private life. We could hear how one of you had “done” an ugly girl in the weekend, because “the girlfriend was out travelling, which meant there was some serious [f—ing] to do”. Apparently, you won’t be as picky then, and even the ugly girls can “get a piece” of yours. We could also follow how all girls entering were rated “totally nice”, “semi”, and “ok with the lights off” and other more and less flattering phrases. Photos of the aforementioned ugly girl were shared, and I heard one of you show off with how you, when you’re out at night with your friends, feel awesome treating women “as crappy as possible”. (…)1 Joe &amp; the Juice Kaspar Basse founded the company in Denmark in 2002. It has become the biggest juice-bar chain in Denmark with affiliates in the U.K., Germany, Norway, Sweden, and Iceland. It was acquired in 2013 by Swedish private-equity group Valedo Partners. In the bars, customers lounge with their juices and sandwiches. All bars are heavily branded with an environment of loud music and noises, and a staff of fresh-faced men exuding a upbeat, chatty, and fratty demeanour. The branded culture is evident a menu featuring juices like “Joe’s Green Kiss”, “Sex Me Up”, and “Young Blood”2. The Abercrombie &amp; Sandwich concept has been adopted by competing juice bars such as Big Apple. The Reaction Nygaard’s Facebook post sparked a fiery discussion and quickly prompted coverage all over Danish media.3 Five hours after the original post, Joe &amp; the Juice responded in a hastily-scribbled Facebook comment. It was penned by Simon Nielsen, the company’s Academy Leader and Brand Police4. The statement reads5: Hi Lisa First of all, thanks for bringing this episode to our attention. Since you wrote the post, I’ve been trying to get a hold of the employees, who worked that day, to deal with the matter. I have been in touch with the manager of the bar and the employees, and it will be dealt with immediately, as we find it completely unacceptable, and it is far away from our own values for such language to be used in a bar to talk about other people like that. I am sorry that you and your daughters had to witness this, and I want to assure you it won’t happen again. We hope that you will return, and arrangements will obviously be made for a better experience on the house. Once again, many apologies on behalf of us and the boys … I’ll give them an earful, and hopefully, this will be a lesson to them. Kind regards, Simon Nielsen, Academy Leader - Joe &amp; the Juice. The exact consequences of the incident have yet to be specified. The rest of Nygaard’s Facebook post translated: It’s one thing that you ruined our meal completely with your completely ridiculous discussion of the wonderful sex, which you instead should hallow and respect, and that my girls, who still believe they’re worth as much as the boys in the kindergarten, had to listen to you rate and disrespect women in that vicious way. Another is that I assume that you all have moms, who’ve given birth to you, nursed you, and been the most important woman for the majority of your life, and if you’re lucky, you’ll have some beautiful daughters one da (when you grow up) . but try to consider what world you’ll release them into? A world full of boys like you. I forgive you, because after all, you aren’t any older. And because you apparently are so insecure about yourselves, your sexuality, and your own worth that it’s the only way you can communicate with each other. But I implore you to reconsider your conduct anyway - for your customers’ sake, for your own sake, and for your future daughters’ sake. There are so many people who think you are “awesome”, so what about making a difference and being a part of changing teenage boys’ perception of the opposite sex? Perhaps you can focus on respecting all the wonderful girls and women out there - and stop the hatred? Kind regards, Lisa Björt Nygaard &#8617; Sandwich names taken from the website menu; the juice names are respectively covered by ™, ®, and ®. &#8617; Coverage in Ekstra Bladet, BT, TV 2. &#8617; Nielsen’s job titles are in the parlance of his own LinekdIn profile. &#8617; The informal nature of Nielsen’s comment, with errant spelling and punctuation, is not reflected in the translation. &#8617;"
        
          , "summary": "Lisa B. Nygaard got more than she ordered, when she took her two daughters to a Joe &amp; the Juice bar. She took to sharing her experience as an open letter on Facebook:"
        
        
        
        
          
          , "tags": ["CSS","Cosmos","Social Save"]
        
        , "date_published": "2020-05-07T18:16:49+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Julia Kehnkha"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/05/02/two-killed-in-armed-robbery-gone-wrong-in-nkwerre",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/05/02/two-killed-in-armed-robbery-gone-wrong-in-nkwerre/",
        
        "title": "Two killed in sophisticated armed robbery gone wrong in Nkwerre",
        
        "content_html": "<p>My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges.</p>\n\n<p>The major challenge I think I’ve faced so far is working with git. I have worked with git in the past but not like I’ve had to within this past few weeks on this project. My issue with git started during the contribution period when I had to rebase my changes with the upstream master, there was a lot of back and forth between me and my mentor because she couldn’t merge my pull request due to the conflicts. All these back and forth and time wasting happened simply becuase I was ashamed to tell my mentor that I had issues with git especially since it wasn’t an issue with the project itself. I thought it would make her look down on me but I was wrong.  This issue took me days to resolve and after trying all I could, I just opted to delete my branch and create a clean branch to work on. At that time I was happy and relieved since I had found a way to get rid of the problem, but the truth is I didn’t fix the issue I only found a way around it, which wasn’t sustainable because I can’t keep deleting branches whenever there’s a merge conflict but I didn’t think of this at that time.</p>\n\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/05/02/two-killed-in-armed-robbery-gone-wrong-in-nkwerre/\" rel=\"nofollow\">Two killed in sophisticated armed robbery gone wrong in Nkwerre</a> was originally published on Nwangele Post.</p>",
        "content_text": "My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges. The major challenge I think I’ve faced so far is working with git. I have worked with git in the past but not like I’ve had to within this past few weeks on this project. My issue with git started during the contribution period when I had to rebase my changes with the upstream master, there was a lot of back and forth between me and my mentor because she couldn’t merge my pull request due to the conflicts. All these back and forth and time wasting happened simply becuase I was ashamed to tell my mentor that I had issues with git especially since it wasn’t an issue with the project itself. I thought it would make her look down on me but I was wrong. This issue took me days to resolve and after trying all I could, I just opted to delete my branch and create a clean branch to work on. At that time I was happy and relieved since I had found a way to get rid of the problem, but the truth is I didn’t fix the issue I only found a way around it, which wasn’t sustainable because I can’t keep deleting branches whenever there’s a merge conflict but I didn’t think of this at that time."
        
          , "summary": "My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges."
        
        
        
        
          
          , "tags": ["Anti-social","CSS","Cosmos"]
        
        , "date_published": "2020-05-02T18:16:49+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Julia Kehnkha"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/04/29/bisike-day-date-set-for%20december-31",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/04/29/bisike-day-date-set-for-december-31/",
        
        "title": "Bisike day set for the 31st of ddecember 2020",
        
        "content_html": "<p>On Thursday the 28th, people in Denmark was confounded to receive a bulletin from the Copenhagen police concerning a person exhibiting “suspicious behaviour”.</p>\n\n<p>People following the development on Twitter would experience it like this:</p>\n\n<p>What, exactly, sent Copenhagen into high alert?</p>\n\n<p><strong>Alisiv Ceran</strong> is a 21-year-old English and Mandarin student at the University of Copenhagen. He was on the train heading for a written exam on the subject of the War on Terror for his course on American history.</p>\n\n<p>As this was the kind of test you have 24 hours to prepare for, operating on three to four hours of sleep, Ceran was still going through his book on 9-11 on the ride towards his destination. Nervous about the impending exam, he locked eyes with a fellow passenger by Nørreport train station and attempted a smile, but knocked over his luggage case which contained the printer he had to bring for the exam.</p>\n\n<p>The woman he had clumsily attempted a smile at was, apparently, so distraught by the experience that she called the police to tip them off to what she perceived as “suspicious behaviour”. The police found her a “very credible” witness and kicked everything into gear.</p>\n\n<p><img src=\"/assets/images/uploads/random/untitled55.png\" class=\"inner_post-img\" alt=\"\" style=\"margin-bottom: 2em;\" /></p>\n\n<p>Once more, here is the police’s version of how events transpired in their final press statement on the false alarm:</p>\n\n<blockquote>\n  <p>This morning, Copenhagen Police received a report of a person in a train who exhibited suspicious behaviour. After the police’s assessment of the report, it was decided to start a search for the person, as we wanted to clear up what was behind the behaviour. The police concluded that the witness was very credible and takes such reports seriously.</p>\n\n  <p>- We have nothing but good reason to praise [/applaud] the reporter for being alert and for doing the only right thing, which is to contact the police about their observations. It creates a feeling of safety in the society that the citizen wishes to aid the police, says vice chief superintendent Claus Hjelm Olsen, who lead today’s police operation.</p>\n\n  <p>- We are aware that a massive police presence can create a certain discomfort, so we found it important to inform the population about what the background was, says Claus Hjelm Olsen.</p>\n\n  <p>Copenhagen Police’s massive effort had the intent of uncovering whether there was a criminal situation. When the wanted person was identified and approached, it turned out that it was a case of a perfectly legal situation, and the search was called off.</p>\n\n  <p>- We have received great help from the population, who’ve reacted appropriately during the situation. Based on our use of Twitter, we received great tips in our Service Centre. Huge kudos [/applause] to the public and the wanted’s family for their way of handling the situation. The wanted person, too, has handled all the ruckus with an understanding of the police’s reaction, and we want to emphasize that he in no way was known by the police already, says Claus Hjelm Olsen.</p>\n</blockquote>\n\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/04/29/bisike-day-date-set-for-december-31/\" rel=\"nofollow\">Bisike day set for the 31st of ddecember 2020</a> was originally published on Nwangele Post.</p>",
        "content_text": "On Thursday the 28th, people in Denmark was confounded to receive a bulletin from the Copenhagen police concerning a person exhibiting “suspicious behaviour”. People following the development on Twitter would experience it like this: What, exactly, sent Copenhagen into high alert? Alisiv Ceran is a 21-year-old English and Mandarin student at the University of Copenhagen. He was on the train heading for a written exam on the subject of the War on Terror for his course on American history. As this was the kind of test you have 24 hours to prepare for, operating on three to four hours of sleep, Ceran was still going through his book on 9-11 on the ride towards his destination. Nervous about the impending exam, he locked eyes with a fellow passenger by Nørreport train station and attempted a smile, but knocked over his luggage case which contained the printer he had to bring for the exam. The woman he had clumsily attempted a smile at was, apparently, so distraught by the experience that she called the police to tip them off to what she perceived as “suspicious behaviour”. The police found her a “very credible” witness and kicked everything into gear. Once more, here is the police’s version of how events transpired in their final press statement on the false alarm: This morning, Copenhagen Police received a report of a person in a train who exhibited suspicious behaviour. After the police’s assessment of the report, it was decided to start a search for the person, as we wanted to clear up what was behind the behaviour. The police concluded that the witness was very credible and takes such reports seriously. - We have nothing but good reason to praise [/applaud] the reporter for being alert and for doing the only right thing, which is to contact the police about their observations. It creates a feeling of safety in the society that the citizen wishes to aid the police, says vice chief superintendent Claus Hjelm Olsen, who lead today’s police operation. - We are aware that a massive police presence can create a certain discomfort, so we found it important to inform the population about what the background was, says Claus Hjelm Olsen. Copenhagen Police’s massive effort had the intent of uncovering whether there was a criminal situation. When the wanted person was identified and approached, it turned out that it was a case of a perfectly legal situation, and the search was called off. - We have received great help from the population, who’ve reacted appropriately during the situation. Based on our use of Twitter, we received great tips in our Service Centre. Huge kudos [/applause] to the public and the wanted’s family for their way of handling the situation. The wanted person, too, has handled all the ruckus with an understanding of the police’s reaction, and we want to emphasize that he in no way was known by the police already, says Claus Hjelm Olsen."
        
          , "summary": "On Thursday the 28th, people in Denmark was confounded to receive a bulletin from the Copenhagen police concerning a person exhibiting “suspicious behaviour”."
        
        
        
        
          
          , "tags": ["Concert","Cosmos","latest"]
        
        , "date_published": "2020-04-29T18:16:49+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Angelina Okoli"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/04/27/45",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/04/27/45/",
        
        "title": "Talk.CSS #45 We’re Still Here edition",
        
        "content_html": "<p>4 years. 45 meetups. So many memories. None of this would have been possible without your support. CSS isn’t the most cool or most sexy part of web development, but it is and will always be my favourite. And even though it may not be yours, we are so grateful that you’ve indulged in our passion for CSS by turning out month after month.</p>\n\n<p>Thank you all for being part of this journey with us. ❤️🧡💛💚💙💜</p>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/04/27/45/\" rel=\"nofollow\">Talk.CSS #45 We're Still Here edition</a> was originally published on Nwangele Post.</p>",
        "content_text": "4 years. 45 meetups. So many memories. None of this would have been possible without your support. CSS isn’t the most cool or most sexy part of web development, but it is and will always be my favourite. And even though it may not be yours, we are so grateful that you’ve indulged in our passion for CSS by turning out month after month. Thank you all for being part of this journey with us. ❤️🧡💛💚💙💜"
        
          , "summary": "4 years. 45 meetups. So many memories. None of this would have been possible without your support. CSS isn’t the most cool or most sexy part of web development, but it is and will always be my favourite. And even though it may not be yours, we are so grateful that you’ve indulged in our passion for CSS by turning out month after month."
        
        
        
        
          
          , "tags": ["Inequality","Nwangele","TALKCSS"]
        
        , "date_published": "2020-04-27T09:00:00+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Zainab Okoye"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/03/27/46",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/03/27/46/",
        
        "title": "Talk.CSS #46",
        
        "content_html": "<p>First Talk.CSS of the decade went fairly well, in spite of being on the same day as the crowd-drawing Figma meetup. It was a good turnout and we love each and every one of you for supporting us. If you went to the Figma meetup instead, it’s okay, we still love you too.</p>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/03/27/46/\" rel=\"nofollow\">Talk.CSS #46</a> was originally published on Nwangele Post.</p>",
        "content_text": "First Talk.CSS of the decade went fairly well, in spite of being on the same day as the crowd-drawing Figma meetup. It was a good turnout and we love each and every one of you for supporting us. If you went to the Figma meetup instead, it’s okay, we still love you too."
        
          , "summary": "First Talk.CSS of the decade went fairly well, in spite of being on the same day as the crowd-drawing Figma meetup. It was a good turnout and we love each and every one of you for supporting us. If you went to the Figma meetup instead, it’s okay, we still love you too."
        
        
        
        
          
          , "tags": ["Inequality","Nwangele","TalkCSS"]
        
        , "date_published": "2020-03-27T12:00:00+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Angelina Okoli"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/01/27/47",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/01/27/47/",
        
        "title": "Man Wins Lawsuit for Enduring Mistaken Anti-Terror Manhunt",
        
        "content_html": "<p>Due to concerns over the nCoV-2019 virus, we have decided to invoke Plan V and do Talk.CSS #47 completely online. Thank you to the 4 people who dialed-in. Your presence will be forever preserved on video. ICYMI, our theme this month was clearly “Testing in Production” as Sheldon and I just live-coded stuff.</p>\n\n<p>Big thanks to Michael for handling the technical setup and uploading the videos before I even ate dinner. We are now 47-in-a-row. I swear I’m not OCD.</p>\n\n<p>Almost one year after <a href=\"/articles/2014/08/29/antiterror-manhunt/\"><strong>Alisiv Ceran</strong> was the subject of a massive manhunt</a> based on a single train passenger’s report, Ceran was awarded 35,000 DKK ($5,000) in damages. He initially sought 75,000 ($11,000).</p>\n\n<p>In <a href=\"https://www.dr.dk/nyheder/indland/menneskejagt-paa-terrormistaenkt-studerende-udloeser-erstatning\">an interview with DR</a>, Ceran’s lawyer reacted to the verdict:</p>\n\n<blockquote>\n  <p>He was cleared of suspicion, but on the other hand, the exposure of him forced him to go public and clear his name in the media.</p>\n</blockquote>\n\n<p>About the damages awarded:</p>\n\n<blockquote>\n  <p>We set the damages sought to 75,000 DKK, because we didn’t have any precedent. That gave the prosecution a span for meting out the damages according to they found fair.</p>\n</blockquote>\n\n<p>In closing, on the public prosecutor’s ruling:</p>\n\n<blockquote>\n  <p>They believe the police were required to respond. They don’t think the police did anything wrong. On the other hand, my client endured this tort.</p>\n</blockquote>\n\n<p>Ceran’s lawyer believes the verdict to be principle, and that this will help others enduring a similar suspicion to seek similar damages.</p>\n\n<h3 id=\"related-articles\">Related Articles</h3>\n\n<ul>\n  <li><a href=\"/articles/2014/08/29/antiterror-manhunt/\">“Copenhagen Police and Media Sound Anti-Terror Alarm over Woman’s Unease at Train Passenger”</a></li>\n</ul>\n\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/01/27/47/\" rel=\"nofollow\">Man Wins Lawsuit for Enduring Mistaken Anti-Terror Manhunt</a> was originally published on Nwangele Post.</p>",
        "content_text": "Due to concerns over the nCoV-2019 virus, we have decided to invoke Plan V and do Talk.CSS #47 completely online. Thank you to the 4 people who dialed-in. Your presence will be forever preserved on video. ICYMI, our theme this month was clearly “Testing in Production” as Sheldon and I just live-coded stuff. Big thanks to Michael for handling the technical setup and uploading the videos before I even ate dinner. We are now 47-in-a-row. I swear I’m not OCD. Almost one year after Alisiv Ceran was the subject of a massive manhunt based on a single train passenger’s report, Ceran was awarded 35,000 DKK ($5,000) in damages. He initially sought 75,000 ($11,000). In an interview with DR, Ceran’s lawyer reacted to the verdict: He was cleared of suspicion, but on the other hand, the exposure of him forced him to go public and clear his name in the media. About the damages awarded: We set the damages sought to 75,000 DKK, because we didn’t have any precedent. That gave the prosecution a span for meting out the damages according to they found fair. In closing, on the public prosecutor’s ruling: They believe the police were required to respond. They don’t think the police did anything wrong. On the other hand, my client endured this tort. Ceran’s lawyer believes the verdict to be principle, and that this will help others enduring a similar suspicion to seek similar damages. Related Articles “Copenhagen Police and Media Sound Anti-Terror Alarm over Woman’s Unease at Train Passenger”"
        
          , "summary": "Due to concerns over the nCoV-2019 virus, we have decided to invoke Plan V and do Talk.CSS #47 completely online. Thank you to the 4 people who dialed-in. Your presence will be forever preserved on video. ICYMI, our theme this month was clearly “Testing in Production” as Sheldon and I just live-coded stuff."
        
        
        
        
          
          , "tags": ["History","Inequality","Manhunt"]
        
        , "date_published": "2020-01-27T09:00:00+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Jude Amadi"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/01/27/How-the-Nwangele-Became-the-source-of-community-unity-among-men",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/01/27/How-the-Nwangele-Became-the-source-of-community-unity-among-men/",
        
        "title": "How the Nwangele River became the source of community unity among men",
        
        "content_html": "<p>My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges.</p>\n\n<h3 id=\"major-challenge-faced-so-far\">Major Challenge Faced So Far</h3>\n\n<p>The major challenge I think I’ve faced so far is working with git. I have worked with git in the past but not like I’ve had to within this past few weeks on this project. My issue with git started during the contribution period when I had to rebase my changes with the upstream master, there was a lot of back and forth between me and my mentor because she couldn’t merge my pull request due to the conflicts. All these back and forth and time wasting happened simply becuase I was ashamed to tell my mentor that I had issues with git especially since it wasn’t an issue with the project itself. I thought it would make her look down on me but I was wrong.  This issue took me days to resolve and after trying all I could, I just opted to delete my branch and create a clean branch to work on. At that time I was happy and relieved since I had found a way to get rid of the problem, but the truth is I didn’t fix the issue I only found a way around it, which wasn’t sustainable because I can’t keep deleting branches whenever there’s a merge conflict but I didn’t think of this at that time.</p>\n\n<p>I came across the same problem after I started my internship, and since I only bypassed it the first time, I couldn’t solve it, my commits kept increasing trying to resolve conflicts that still resurfaced when my mentor tried to merge, It was like I was going in circles, I was stuck again, and I couldn’t delete my branch again like I did initially so this time, I sought for help from my mentor. We had a chat session where she put me through <code class=\"highlighter-rouge\">merging commits</code>, <code class=\"highlighter-rouge\">rebasing my branch with the upstream master</code> and from this session I got to see all the errors I was making and fixed them. I also made sure to note down all the commands we used for future reference. And that was how I was able to solve a problem I had battled with for days in just few minutes with the help of my mentor.</p>\n\n<h3 id=\"lesson-learnt\">Lesson Learnt</h3>\n\n<p>Nobody is perfect, just as no man is an Island. I could have saved so much time if I had simply just asked for help from my mentor or the community when I encountered difficulty in fixing the issue the first time, but I didn’t. There is no shame in making mistakes and facing challenges, it’s a something everyone at the top has passed through and can relate to, and the best thing to do when such situations happen is to fix them and learn from them so you don’t make those mistakes or face those challenges again and even if you do or encounter someone else facing the same challenge which is possible, fixing it wouldn’t be a problem.</p>\n\n<p>Another improtant lesson learnt is <code class=\"highlighter-rouge\">do not take shortcuts</code>. As a developer, I know how frustrating challenges and bugs can be especially when you are on a timeline, and how tempting it can be to take the easier route which in most cases, is just a workaround and not exactly a solution to the problem. Yeah, it may seem better at the moment but the truth is most times, these solutions aren’t sustainable and can even lead to even more bugs to manage, thereby wasting more time and resources. So my advice will be to ask questions, research and don’t stay glued to your screen for long hours trying to solve the same problem because at some point you start to try the same things over and over again, expecting to get a different result and when you don’t, you get dissapointed. So instead of working long hours at a stretch, take breaks, when you get back you might be able to look at things a bit differently and when you finally fix that bug, issue, mistake, challenge or whatever it may be, <code class=\"highlighter-rouge\">document</code> everything. Do not just assume you have known it and can’t forget, be sure to put down your findings so when you or anyone else passes through the same issue, you can pass your solution on to them easily and save yourselves a lot of time.</p>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/01/27/How-the-Nwangele-Became-the-source-of-community-unity-among-men/\" rel=\"nofollow\">How the Nwangele River became the source of community unity among men</a> was originally published on Nwangele Post.</p>",
        "content_text": "My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges. Major Challenge Faced So Far The major challenge I think I’ve faced so far is working with git. I have worked with git in the past but not like I’ve had to within this past few weeks on this project. My issue with git started during the contribution period when I had to rebase my changes with the upstream master, there was a lot of back and forth between me and my mentor because she couldn’t merge my pull request due to the conflicts. All these back and forth and time wasting happened simply becuase I was ashamed to tell my mentor that I had issues with git especially since it wasn’t an issue with the project itself. I thought it would make her look down on me but I was wrong. This issue took me days to resolve and after trying all I could, I just opted to delete my branch and create a clean branch to work on. At that time I was happy and relieved since I had found a way to get rid of the problem, but the truth is I didn’t fix the issue I only found a way around it, which wasn’t sustainable because I can’t keep deleting branches whenever there’s a merge conflict but I didn’t think of this at that time. I came across the same problem after I started my internship, and since I only bypassed it the first time, I couldn’t solve it, my commits kept increasing trying to resolve conflicts that still resurfaced when my mentor tried to merge, It was like I was going in circles, I was stuck again, and I couldn’t delete my branch again like I did initially so this time, I sought for help from my mentor. We had a chat session where she put me through merging commits, rebasing my branch with the upstream master and from this session I got to see all the errors I was making and fixed them. I also made sure to note down all the commands we used for future reference. And that was how I was able to solve a problem I had battled with for days in just few minutes with the help of my mentor. Lesson Learnt Nobody is perfect, just as no man is an Island. I could have saved so much time if I had simply just asked for help from my mentor or the community when I encountered difficulty in fixing the issue the first time, but I didn’t. There is no shame in making mistakes and facing challenges, it’s a something everyone at the top has passed through and can relate to, and the best thing to do when such situations happen is to fix them and learn from them so you don’t make those mistakes or face those challenges again and even if you do or encounter someone else facing the same challenge which is possible, fixing it wouldn’t be a problem. Another improtant lesson learnt is do not take shortcuts. As a developer, I know how frustrating challenges and bugs can be especially when you are on a timeline, and how tempting it can be to take the easier route which in most cases, is just a workaround and not exactly a solution to the problem. Yeah, it may seem better at the moment but the truth is most times, these solutions aren’t sustainable and can even lead to even more bugs to manage, thereby wasting more time and resources. So my advice will be to ask questions, research and don’t stay glued to your screen for long hours trying to solve the same problem because at some point you start to try the same things over and over again, expecting to get a different result and when you don’t, you get dissapointed. So instead of working long hours at a stretch, take breaks, when you get back you might be able to look at things a bit differently and when you finally fix that bug, issue, mistake, challenge or whatever it may be, document everything. Do not just assume you have known it and can’t forget, be sure to put down your findings so when you or anyone else passes through the same issue, you can pass your solution on to them easily and save yourselves a lot of time."
        
          , "summary": "My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges."
        
        
        
        
          
          , "tags": ["History","Inequality","Nwangele"]
        
        , "date_published": "2020-01-27T09:00:00+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Onyeka Chris"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/01/27/44",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/01/27/44/",
        
        "title": "Jock Strapper 5,000 art collections are up for sale in Conakary",
        
        "content_html": "<p>We were graciously hosted by GovTech for the first time and turn-out was nice. Dial-in talk wasn’t a complete bomb so thank you for all the positive vibes to ensure the internet connection was good. Video recording also didn’t fail. When good things happen, don’t ask questions.</p>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/01/27/44/\" rel=\"nofollow\">Jock Strapper 5,000 art collections are up for sale in Conakary</a> was originally published on Nwangele Post.</p>",
        "content_text": "We were graciously hosted by GovTech for the first time and turn-out was nice. Dial-in talk wasn’t a complete bomb so thank you for all the positive vibes to ensure the internet connection was good. Video recording also didn’t fail. When good things happen, don’t ask questions."
        
          , "summary": "We were graciously hosted by GovTech for the first time and turn-out was nice. Dial-in talk wasn’t a complete bomb so thank you for all the positive vibes to ensure the internet connection was good. Video recording also didn’t fail. When good things happen, don’t ask questions."
        
        
        
        
          
          , "tags": ["Artistry","Inequality","Nwangele"]
        
        , "date_published": "2020-01-27T09:00:00+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Onyeka Chris"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/01/27/43",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/01/27/43/",
        
        "title": "Amazon planning on developing flying cars by the end of 2030",
        
        "content_html": "<p>Back at HOOQ and this time we had 3 great lightning talks by 3 great speakers. If you didn’t show up, well, you know that we almost always have video. Almost always. Anyway, try to come next time, okay?</p>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/01/27/43/\" rel=\"nofollow\">Amazon planning on developing flying cars by the end of 2030</a> was originally published on Nwangele Post.</p>",
        "content_text": "Back at HOOQ and this time we had 3 great lightning talks by 3 great speakers. If you didn’t show up, well, you know that we almost always have video. Almost always. Anyway, try to come next time, okay?"
        
          , "summary": "Back at HOOQ and this time we had 3 great lightning talks by 3 great speakers. If you didn’t show up, well, you know that we almost always have video. Almost always. Anyway, try to come next time, okay?"
        
        
        
        
          
          , "tags": ["Futuristic","Inequality","Nwangele"]
        
        , "date_published": "2020-01-27T09:00:00+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Dwight Auba"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/latest%20news/2020/01/27/38",
        "url": "https//test-np.netlify.app/np-site/latest%20news/2020/01/27/38/",
        
        "title": "Talk.CSS #38 Codepen edition",
        
        "content_html": "<p>We finally had a long overdue CodePen edition, but in addition to that, we also had one of the best talks at Talk.CSS  by <a href=\"https://wgao19.cc/\">Gao Wei</a> on CSS blend-modes. She has also been cheated onto the SingaporeCSS pirate ship as our new co-organiser. <span class=\"emoji\" role=\"img\" tabindex=\"0\" aria-label=\"women with bunny ears\">👯‍♀️</span></p>\n\n<figure>\n  <img src=\"https//test-np.netlify.app/assets/img/pirate-ship.jpg\" srcset=\"https//test-np.netlify.app/assets/img/pirate-ship@2x.jpg 2x\" alt=\"The SingaporeCSS pirate ship\" />\n  <figcaption>Follow @wgao19 on all the things</figcaption>\n</figure>\n\n<p>Also, to everyone who volunteered for the CodePen Show &amp; Tell, including those who dialed in from overseas. Words cannot describe how grateful I am for your patience and willingness to go along with my hare-brained schemes.</p>\n\n<p>In order of appearance, the biggest thank you to Chris and Sarah Lienert (<span class=\"emoji\" role=\"img\" tabindex=\"0\" aria-label=\"Australia\">🇦🇺</span>), Olivia Ng (<span class=\"emoji\" role=\"img\" tabindex=\"0\" aria-label=\"United States of America\">🇺🇸</span>), Ayaka Sasaki (<span class=\"emoji\" role=\"img\" tabindex=\"0\" aria-label=\"Japan\">🇯🇵</span>), Ten “Tenzy” Zhi Yang, Purnima Kamath and Jay.</p>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/latest%20news/2020/01/27/38/\" rel=\"nofollow\">Talk.CSS #38 Codepen edition</a> was originally published on Nwangele Post.</p>",
        "content_text": "We finally had a long overdue CodePen edition, but in addition to that, we also had one of the best talks at Talk.CSS by Gao Wei on CSS blend-modes. She has also been cheated onto the SingaporeCSS pirate ship as our new co-organiser. 👯‍♀️ Follow @wgao19 on all the things Also, to everyone who volunteered for the CodePen Show &amp; Tell, including those who dialed in from overseas. Words cannot describe how grateful I am for your patience and willingness to go along with my hare-brained schemes. In order of appearance, the biggest thank you to Chris and Sarah Lienert (🇦🇺), Olivia Ng (🇺🇸), Ayaka Sasaki (🇯🇵), Ten “Tenzy” Zhi Yang, Purnima Kamath and Jay."
        
          , "summary": "We finally had a long overdue CodePen edition, but in addition to that, we also had one of the best talks at Talk.CSS by Gao Wei on CSS blend-modes. She has also been cheated onto the SingaporeCSS pirate ship as our new co-organiser. 👯‍♀️"
        
        
        
        
          
          , "tags": ["History","Inequality","Nwangele"]
        
        , "date_published": "2020-01-27T09:00:00+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Tony Chukwu"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/feature/2020/01/10/think-about-your-audience",
        "url": "https//test-np.netlify.app/np-site/feature/2020/01/10/think-about-your-audience/",
        
        "title": "Think About Your Audience - Marketing 101",
        
        "content_html": "<p>MediaWiki is a collaboration and documentation platform brought to you by a vibrant community and anyone who shares Wikimedia’s vision to collect and share knowledge that fully represents human diversity is very much welcome to participate in the community.</p>\n\n<h2 id=\"differences-between-wikipedia-wikimedia-mediawiki-and-wiki\">Differences between Wikipedia, Wikimedia, MediaWiki, and wiki</h2>\n\n<p>You probably know <a href=\"https://en.wikipedia.org/wiki/Wikipedia\">Wikipedia</a>, the free encyclopedia, and may possibly be a little bit confused by similar, but different, words such as Wiki, Wikimedia or <strong>MediaWiki</strong>.</p>\n\n<h3 id=\"wiki\">Wiki</h3>\n\n<p>A wiki is a type of website whose contents can be edited from the web browser, and which keeps a version history for each editable page. Wikis are often, but not always, editable by any visitor to the site.</p>\n\n<h3 id=\"wikimedia\">Wikimedia</h3>\n\n<p>Wikimedia is the collective name for the <a href=\"https://meta.wikimedia.org/wiki/Wikimedia_movement\">Wikimedia movement</a>, revolving around a group of inter-related <a href=\"https://meta.wikimedia.org/wiki/Wikimedia_projects\">projects</a>, including <a href=\"https://meta.wikimedia.org/wiki/Wikipedia\">Wikipedia</a>, <a href=\"https://meta.wikimedia.org/wiki/Wiktionary\">Wiktionary</a>, <a href=\"https://meta.wikimedia.org/wiki/Wikiquote\">Wikiquote</a> and others, which aim to use the collaborative power of the Internet, and the wiki concept, to create and share free knowledge of all kinds</p>\n\n<h3 id=\"wikipedia\">Wikipedia</h3>\n\n<p>Wikipedia is a Wikimedia project that is a global, free and multilingual internet encyclopedia. It is the oldest and largest Wikimedia project, predating the Wikimedia Foundation itself. Wikipedia is often described as a wiki, but it is in fact a collection of over 200 wikis, one for each language, all running on the MediaWiki software.</p>\n\n<p>Now that we have cleared the air on the difference between these concepts, let’s get back to the project I’m currently working on which is Mediawiki</p>\n\n<h2 id=\"what-problem-is-your-community-trying-to-solve\">What problem is your community trying to solve?</h2>\n\n<p>The MediaWiki action API is a web service that allows access to some wiki-features like authentication, page operations, and search. It can provide meta information about the wiki and the logged-in user. Several Wikimedia projects make use of this API.</p>\n\n<p>As of now, there are 128 pages on the Action API on MediaWiki.org. A little research was done on the state of the docs and a few problems and recommendations documented for next steps. One of the issues chosen to address was inconsistency. For example, some pages had the automated API docs embedded; some didn’t, some pages had code samples, some didn’t, etc.</p>\n\n<p>As a first step, a documentation template was designed and used to re-write the top 20 viewed pages of the API. But then, to improve all 128 pages, it was made open to new Wikimedia contributors for help :-) The next 60 pages were improved in the last two Outreachy rounds.</p>\n\n<p>The goal of this project is to improve documentation of ~20 top 100 most viewed MediaWiki Action API pages on-wiki using the documentation template.</p>\n\n<h2 id=\"how-does-mediawiki-fit-into-the-larger-community\">How does Mediawiki fit into the larger community?</h2>\n\n<p>The MediaWiki software is used by tens of thousands of websites and thousands of companies and organizations. It powers Wikipedia and helps collect and organize knowledge and make it available to people. It’s powerful, multilingual, free and open for others to use (and improve), extensible, customizable, reliable, and free of charge.</p>\n\n<p>The site, mediawiki.org, is intended for information about MediaWiki and related software.</p>\n\n<p>Besides Wikimedia sister projects, many other sites exist that are using MediaWiki engine. Such sites based on Mediawiki software generally display the Powered by icon near the bottom right corner of their pages. Some examples include <a href=\"http://www.reviewingaids.com/awiki\">AIDS Wiki</a>, <a href=\"http://www.apple2games.com/\">Apple 2 Games</a>, <a href=\"http://bitcoin.it/\">Bitcoin Wiki</a>, <a href=\"http://biblestrength.com/\">Bible Strength</a> and many more.</p>\n\n<h2 id=\"why-would-people-want-to-use-your-project\">Why would people want to use your project?</h2>\n\n<p>MediaWiki is an extremely powerful, scalable software and a feature-rich wiki implementation that uses PHP to process and display data stored in a database, such as MySQL. Pages use MediaWiki’s wikitext format, so that users without knowledge of HTML or CSS can edit them easily. When a user submits an edit to a page, MediaWiki writes it to the database, but without deleting the previous versions of the page, thus allowing easy reverts in case of vandalism or spamming. MediaWiki can manage image and multimedia files, too, which are stored in the filesystem. For large wikis with lots of users, MediaWiki supports caching and can be easily coupled with proxy server software. With dedicated extensions, MediaWiki can also handle structured data.</p>\n\n<h2 id=\"what-makes-you-most-excited-to-work-on-your-project\">What makes you most excited to work on your project?</h2>\n\n<p>The fact that while improving the documentation to MediaWiki Action API pages in my cubicle, I am also improving the experience of thousands of developers who utilize Mediawiki’s API and also having the opportunity to collaborate with the great minds behind the Wikimedia Foundation (WMF) and improve my skills while doing so.</p>\n\n<h2 id=\"what-new-terms-or-concepts-have-you-learned-in-the-past-month\">What new terms or concepts have you learned in the past month?</h2>\n\n<p>I’ve learned Wiki editing, using mediawiki templates, creating and managing translatable pages and also how to use the <a href=\"https://phabricator.wikimedia.org/\">Wikimedia Phabricator</a> tool.</p>\n\n<h2 id=\"what-was-confusing-to-you-about-the-project\">What was confusing to you about the project?</h2>\n\n<p>Well I’ll say at first creating and managing translatable pages and adding translation tags to my sandbox pages before pushing to the main page was quite confusing but with the help of my mentor and going through resources on translating pages, I am well past that confusion now.</p>\n\n<p>My journey and experience so far with this wonderful community has been an exciting one and I’m ecstatic about the opportunity to learn and collaborate and also experiences that still awaits me.</p>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/feature/2020/01/10/think-about-your-audience/\" rel=\"nofollow\">Think About Your Audience - Marketing 101</a> was originally published on Nwangele Post.</p>",
        "content_text": "MediaWiki is a collaboration and documentation platform brought to you by a vibrant community and anyone who shares Wikimedia’s vision to collect and share knowledge that fully represents human diversity is very much welcome to participate in the community. Differences between Wikipedia, Wikimedia, MediaWiki, and wiki You probably know Wikipedia, the free encyclopedia, and may possibly be a little bit confused by similar, but different, words such as Wiki, Wikimedia or MediaWiki. Wiki A wiki is a type of website whose contents can be edited from the web browser, and which keeps a version history for each editable page. Wikis are often, but not always, editable by any visitor to the site. Wikimedia Wikimedia is the collective name for the Wikimedia movement, revolving around a group of inter-related projects, including Wikipedia, Wiktionary, Wikiquote and others, which aim to use the collaborative power of the Internet, and the wiki concept, to create and share free knowledge of all kinds Wikipedia Wikipedia is a Wikimedia project that is a global, free and multilingual internet encyclopedia. It is the oldest and largest Wikimedia project, predating the Wikimedia Foundation itself. Wikipedia is often described as a wiki, but it is in fact a collection of over 200 wikis, one for each language, all running on the MediaWiki software. Now that we have cleared the air on the difference between these concepts, let’s get back to the project I’m currently working on which is Mediawiki What problem is your community trying to solve? The MediaWiki action API is a web service that allows access to some wiki-features like authentication, page operations, and search. It can provide meta information about the wiki and the logged-in user. Several Wikimedia projects make use of this API. As of now, there are 128 pages on the Action API on MediaWiki.org. A little research was done on the state of the docs and a few problems and recommendations documented for next steps. One of the issues chosen to address was inconsistency. For example, some pages had the automated API docs embedded; some didn’t, some pages had code samples, some didn’t, etc. As a first step, a documentation template was designed and used to re-write the top 20 viewed pages of the API. But then, to improve all 128 pages, it was made open to new Wikimedia contributors for help :-) The next 60 pages were improved in the last two Outreachy rounds. The goal of this project is to improve documentation of ~20 top 100 most viewed MediaWiki Action API pages on-wiki using the documentation template. How does Mediawiki fit into the larger community? The MediaWiki software is used by tens of thousands of websites and thousands of companies and organizations. It powers Wikipedia and helps collect and organize knowledge and make it available to people. It’s powerful, multilingual, free and open for others to use (and improve), extensible, customizable, reliable, and free of charge. The site, mediawiki.org, is intended for information about MediaWiki and related software. Besides Wikimedia sister projects, many other sites exist that are using MediaWiki engine. Such sites based on Mediawiki software generally display the Powered by icon near the bottom right corner of their pages. Some examples include AIDS Wiki, Apple 2 Games, Bitcoin Wiki, Bible Strength and many more. Why would people want to use your project? MediaWiki is an extremely powerful, scalable software and a feature-rich wiki implementation that uses PHP to process and display data stored in a database, such as MySQL. Pages use MediaWiki’s wikitext format, so that users without knowledge of HTML or CSS can edit them easily. When a user submits an edit to a page, MediaWiki writes it to the database, but without deleting the previous versions of the page, thus allowing easy reverts in case of vandalism or spamming. MediaWiki can manage image and multimedia files, too, which are stored in the filesystem. For large wikis with lots of users, MediaWiki supports caching and can be easily coupled with proxy server software. With dedicated extensions, MediaWiki can also handle structured data. What makes you most excited to work on your project? The fact that while improving the documentation to MediaWiki Action API pages in my cubicle, I am also improving the experience of thousands of developers who utilize Mediawiki’s API and also having the opportunity to collaborate with the great minds behind the Wikimedia Foundation (WMF) and improve my skills while doing so. What new terms or concepts have you learned in the past month? I’ve learned Wiki editing, using mediawiki templates, creating and managing translatable pages and also how to use the Wikimedia Phabricator tool. What was confusing to you about the project? Well I’ll say at first creating and managing translatable pages and adding translation tags to my sandbox pages before pushing to the main page was quite confusing but with the help of my mentor and going through resources on translating pages, I am well past that confusion now. My journey and experience so far with this wonderful community has been an exciting one and I’m ecstatic about the opportunity to learn and collaborate and also experiences that still awaits me."
        
          , "summary": "MediaWiki is a collaboration and documentation platform brought to you by a vibrant community and anyone who shares Wikimedia’s vision to collect and share knowledge that fully represents human diversity is very much welcome to participate in the community."
        
        
        
        
          
          , "tags": ["Advice","Carreers","Marketing 101","MediaWiki"]
        
        , "date_published": "2020-01-10T18:16:49+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Kwame Kwadon"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/feature/2019/12/28/outreachy-everybody-struggles",
        "url": "https//test-np.netlify.app/np-site/feature/2019/12/28/outreachy-everybody-struggles/",
        
        "title": "Just know that Everybody Struggles",
        
        "content_html": "<p>My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges.</p>\n\n<h3 id=\"major-challenge-faced-so-far\">Major Challenge Faced So Far</h3>\n\n<p>The major challenge I think I’ve faced so far is working with git. I have worked with git in the past but not like I’ve had to within this past few weeks on this project. My issue with git started during the contribution period when I had to rebase my changes with the upstream master, there was a lot of back and forth between me and my mentor because she couldn’t merge my pull request due to the conflicts. All these back and forth and time wasting happened simply becuase I was ashamed to tell my mentor that I had issues with git especially since it wasn’t an issue with the project itself. I thought it would make her look down on me but I was wrong.  This issue took me days to resolve and after trying all I could, I just opted to delete my branch and create a clean branch to work on. At that time I was happy and relieved since I had found a way to get rid of the problem, but the truth is I didn’t fix the issue I only found a way around it, which wasn’t sustainable because I can’t keep deleting branches whenever there’s a merge conflict but I didn’t think of this at that time.</p>\n\n<p>I came across the same problem after I started my internship, and since I only bypassed it the first time, I couldn’t solve it, my commits kept increasing trying to resolve conflicts that still resurfaced when my mentor tried to merge, It was like I was going in circles, I was stuck again, and I couldn’t delete my branch again like I did initially so this time, I sought for help from my mentor. We had a chat session where she put me through <code class=\"highlighter-rouge\">merging commits</code>, <code class=\"highlighter-rouge\">rebasing my branch with the upstream master</code> and from this session I got to see all the errors I was making and fixed them. I also made sure to note down all the commands we used for future reference. And that was how I was able to solve a problem I had battled with for days in just few minutes with the help of my mentor.</p>\n\n<h3 id=\"lesson-learnt\">Lesson Learnt</h3>\n\n<p>Nobody is perfect, just as no man is an Island. I could have saved so much time if I had simply just asked for help from my mentor or the community when I encountered difficulty in fixing the issue the first time, but I didn’t. There is no shame in making mistakes and facing challenges, it’s a something everyone at the top has passed through and can relate to, and the best thing to do when such situations happen is to fix them and learn from them so you don’t make those mistakes or face those challenges again and even if you do or encounter someone else facing the same challenge which is possible, fixing it wouldn’t be a problem.</p>\n\n<p>Another improtant lesson learnt is <code class=\"highlighter-rouge\">do not take shortcuts</code>. As a developer, I know how frustrating challenges and bugs can be especially when you are on a timeline, and how tempting it can be to take the easier route which in most cases, is just a workaround and not exactly a solution to the problem. Yeah, it may seem better at the moment but the truth is most times, these solutions aren’t sustainable and can even lead to even more bugs to manage, thereby wasting more time and resources. So my advice will be to ask questions, research and don’t stay glued to your screen for long hours trying to solve the same problem because at some point you start to try the same things over and over again, expecting to get a different result and when you don’t, you get dissapointed. So instead of working long hours at a stretch, take breaks, when you get back you might be able to look at things a bit differently and when you finally fix that bug, issue, mistake, challenge or whatever it may be, <code class=\"highlighter-rouge\">document</code> everything. Do not just assume you have known it and can’t forget, be sure to put down your findings so when you or anyone else passes through the same issue, you can pass your solution on to them easily and save yourselves a lot of time.</p>\n\n          <p><a href=\"https//test-np.netlify.app/np-site/feature/2019/12/28/outreachy-everybody-struggles/\" rel=\"nofollow\">Just know that Everybody Struggles</a> was originally published on Nwangele Post.</p>",
        "content_text": "My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges. Major Challenge Faced So Far The major challenge I think I’ve faced so far is working with git. I have worked with git in the past but not like I’ve had to within this past few weeks on this project. My issue with git started during the contribution period when I had to rebase my changes with the upstream master, there was a lot of back and forth between me and my mentor because she couldn’t merge my pull request due to the conflicts. All these back and forth and time wasting happened simply becuase I was ashamed to tell my mentor that I had issues with git especially since it wasn’t an issue with the project itself. I thought it would make her look down on me but I was wrong. This issue took me days to resolve and after trying all I could, I just opted to delete my branch and create a clean branch to work on. At that time I was happy and relieved since I had found a way to get rid of the problem, but the truth is I didn’t fix the issue I only found a way around it, which wasn’t sustainable because I can’t keep deleting branches whenever there’s a merge conflict but I didn’t think of this at that time. I came across the same problem after I started my internship, and since I only bypassed it the first time, I couldn’t solve it, my commits kept increasing trying to resolve conflicts that still resurfaced when my mentor tried to merge, It was like I was going in circles, I was stuck again, and I couldn’t delete my branch again like I did initially so this time, I sought for help from my mentor. We had a chat session where she put me through merging commits, rebasing my branch with the upstream master and from this session I got to see all the errors I was making and fixed them. I also made sure to note down all the commands we used for future reference. And that was how I was able to solve a problem I had battled with for days in just few minutes with the help of my mentor. Lesson Learnt Nobody is perfect, just as no man is an Island. I could have saved so much time if I had simply just asked for help from my mentor or the community when I encountered difficulty in fixing the issue the first time, but I didn’t. There is no shame in making mistakes and facing challenges, it’s a something everyone at the top has passed through and can relate to, and the best thing to do when such situations happen is to fix them and learn from them so you don’t make those mistakes or face those challenges again and even if you do or encounter someone else facing the same challenge which is possible, fixing it wouldn’t be a problem. Another improtant lesson learnt is do not take shortcuts. As a developer, I know how frustrating challenges and bugs can be especially when you are on a timeline, and how tempting it can be to take the easier route which in most cases, is just a workaround and not exactly a solution to the problem. Yeah, it may seem better at the moment but the truth is most times, these solutions aren’t sustainable and can even lead to even more bugs to manage, thereby wasting more time and resources. So my advice will be to ask questions, research and don’t stay glued to your screen for long hours trying to solve the same problem because at some point you start to try the same things over and over again, expecting to get a different result and when you don’t, you get dissapointed. So instead of working long hours at a stretch, take breaks, when you get back you might be able to look at things a bit differently and when you finally fix that bug, issue, mistake, challenge or whatever it may be, document everything. Do not just assume you have known it and can’t forget, be sure to put down your findings so when you or anyone else passes through the same issue, you can pass your solution on to them easily and save yourselves a lot of time."
        
          , "summary": "My internship with wikimedia officially kicked off on the 3rd of december 2019. I had a chat session with my mentor where my project tasks were outlined. My first task was to work on pages that weren’t completed during the contribution period. I started working on my first task and so far I’ve been able to work on three pages, create 3 PRs and currently working on the fourth one. The journey so far has been a lot easier for me, thanks to the reports and resources from my mentor, but that’s not to say that I haven’t encountered some challenges."
        
        
        
        
          
          , "tags": ["Advice How To","Internship"]
        
        , "date_published": "2019-12-28T11:16:49+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Angelina Okoli"
          
          
        }
      },
    
      {
        "id": "https//test-np.netlify.app/np-site/feature/2019/12/15/the-tony-invalid-concert",
        "url": "https//test-np.netlify.app/np-site/feature/2019/12/15/the-tony-invalid-concert/",
        
        "title": "The Tony Invalid concert: How it all went Down",
        
        "content_html": "<p>Outreachy is an internship program that helps women and people who are under-represented get more invloved with open source through remote internships. Outreachy provides a supportive community for beginning to contribute any time throughout the year and offer focused internship opportunities twice a year with a number of free software organizations.</p>\n\n<h2 id=\"the-application-process\">The Application Process</h2>\n\n<p>When I first heard of outreachy I was skeptical because I had very little experience in open source. I decided to do some research. After series of research on outreachy and reading the reports and success stories of ex-interns, I was convinced within me that this was the breakthrough I needed to break out of my shell and get more involved in open source.</p>\n\n<p>So I subscribed to Outreachy’s mailing list to get a notification when applications would open and started getting more involved in open source contributions as I was really motivated by all the success stories I had read at this point.</p>\n\n<p>Fastforward few weeks later I submitted my initial application and was ecstatic when it was approved. This took me to the the second phase which is the contribution phase.</p>\n\n<h3 id=\"contribution-phase\">Contribution Phase</h3>\n\n<p><img src=\"/np-site//assets/images/feature-modules/DanBejaDestroyer1.jpg\" alt=\"mosiac feature of drillz concert\" /></p>\n\n<h4 id=\"selecting-a-project\">Selecting a Project</h4>\n\n<p>The contribution phase kicked off on 1st of October and lasted for about a month. It came with the dilemma of selecting a project from the numerous list of projects to contribute to. I wanted to make contributions to at least two different projects to increase my chances of getting selected. I went through all the projects and read their descriptions and required skill set to find a project that matches my skillset and where I knew I could make a difference. I was happy when I came across Mediawiki’s project <code class=\"highlighter-rouge\">Documentation improvements to the ~20 top 100 most viewed MediaWiki Action API pages on-wiki</code>. Wikipedia has always been a primary source of content when carrying out any research for me, from solving school assignments to undergraduate thesis, to post-graduate studies, my software-development career and even getting information on the fly. Though I hadn’t contributed to wikimedia before, although I have worked on improving documentation for an organization before and managed their engineering blog, I decided to take a leap of faith by applying with the mindset that even if I didn’t get accepted, I will have the opportunity to contribute to improving the experience of thousands of developers who utilize Mediawiki’s API and be able to give back to the community that has helped me by so doing. So with that mindset, I chose wikimedia and my contribution phase began.</p>\n\n<h3 id=\"contributing\">Contributing</h3>\n\n<p>After selecting my choice project, I went through all the available resources, registered on the communication platform which was zulip, created a phabricator account and a mediawiki account. I introduced myself on <code class=\"highlighter-rouge\">zulip</code> -MediaWiki’s communication channel- to other members and also to the mentor assigned to me (Brenda Jerop).</p>\n\n<p>Then came the time to actually put in some work. A phabricator page was created for us (applicants) with a list of micro-tasks to work on. Things like API documentation page improvement were included in the tasks. I picked my first task which became my first contribution and started working on it. To be honest it was all overwhelming at first as most of the technologies were a bit new to me. But then there was something very important I learnt from this phase, which is fact that <code class=\"highlighter-rouge\">communication</code> is key. I asked my mentor for guidance whenever I got stuck or was confused coupled with the fact that mediawiki had a lot of resources to help including blog posts and reports of past interns, all you had to do was just look.</p>\n\n<p><img src=\"/np-site//assets/images/uploads/gallery/poster-full.jpg\" alt=\"mosiac feature of drillz concert\" /></p>\n\n<p>I was so excited when I created my first pull request but even more ecstatic when it was merged. I was able to submit three pull requests during the contribution period with one work in progress. Somewhere in between contributions, I drafted out my final application and submitted it to my mentor to review. Then I submitted on outreachy.</p>\n\n<p>One great advice I got for this contribution phase, which I’m happy I took was to start contributing early. At first it might seem like you have enough time but depending on the organization and project you are working on and how familiar you are with their process, you might need some time to understand the tools and process. For me, even though I had worked on similar projects outside wikimedia, I hadn’t contributed to wikimedia before and their processes and tools were slightly different, so starting early gave me enough room to get used to all these.</p>\n\n\n          <p><a href=\"https//test-np.netlify.app/np-site/feature/2019/12/15/the-tony-invalid-concert/\" rel=\"nofollow\">The Tony Invalid concert: How it all went Down</a> was originally published on Nwangele Post.</p>",
        "content_text": "Outreachy is an internship program that helps women and people who are under-represented get more invloved with open source through remote internships. Outreachy provides a supportive community for beginning to contribute any time throughout the year and offer focused internship opportunities twice a year with a number of free software organizations. The Application Process When I first heard of outreachy I was skeptical because I had very little experience in open source. I decided to do some research. After series of research on outreachy and reading the reports and success stories of ex-interns, I was convinced within me that this was the breakthrough I needed to break out of my shell and get more involved in open source. So I subscribed to Outreachy’s mailing list to get a notification when applications would open and started getting more involved in open source contributions as I was really motivated by all the success stories I had read at this point. Fastforward few weeks later I submitted my initial application and was ecstatic when it was approved. This took me to the the second phase which is the contribution phase. Contribution Phase Selecting a Project The contribution phase kicked off on 1st of October and lasted for about a month. It came with the dilemma of selecting a project from the numerous list of projects to contribute to. I wanted to make contributions to at least two different projects to increase my chances of getting selected. I went through all the projects and read their descriptions and required skill set to find a project that matches my skillset and where I knew I could make a difference. I was happy when I came across Mediawiki’s project Documentation improvements to the ~20 top 100 most viewed MediaWiki Action API pages on-wiki. Wikipedia has always been a primary source of content when carrying out any research for me, from solving school assignments to undergraduate thesis, to post-graduate studies, my software-development career and even getting information on the fly. Though I hadn’t contributed to wikimedia before, although I have worked on improving documentation for an organization before and managed their engineering blog, I decided to take a leap of faith by applying with the mindset that even if I didn’t get accepted, I will have the opportunity to contribute to improving the experience of thousands of developers who utilize Mediawiki’s API and be able to give back to the community that has helped me by so doing. So with that mindset, I chose wikimedia and my contribution phase began. Contributing After selecting my choice project, I went through all the available resources, registered on the communication platform which was zulip, created a phabricator account and a mediawiki account. I introduced myself on zulip -MediaWiki’s communication channel- to other members and also to the mentor assigned to me (Brenda Jerop). Then came the time to actually put in some work. A phabricator page was created for us (applicants) with a list of micro-tasks to work on. Things like API documentation page improvement were included in the tasks. I picked my first task which became my first contribution and started working on it. To be honest it was all overwhelming at first as most of the technologies were a bit new to me. But then there was something very important I learnt from this phase, which is fact that communication is key. I asked my mentor for guidance whenever I got stuck or was confused coupled with the fact that mediawiki had a lot of resources to help including blog posts and reports of past interns, all you had to do was just look. I was so excited when I created my first pull request but even more ecstatic when it was merged. I was able to submit three pull requests during the contribution period with one work in progress. Somewhere in between contributions, I drafted out my final application and submitted it to my mentor to review. Then I submitted on outreachy. One great advice I got for this contribution phase, which I’m happy I took was to start contributing early. At first it might seem like you have enough time but depending on the organization and project you are working on and how familiar you are with their process, you might need some time to understand the tools and process. For me, even though I had worked on similar projects outside wikimedia, I hadn’t contributed to wikimedia before and their processes and tools were slightly different, so starting early gave me enough room to get used to all these."
        
          , "summary": "Outreachy is an internship program that helps women and people who are under-represented get more invloved with open source through remote internships. Outreachy provides a supportive community for beginning to contribute any time throughout the year and offer focused internship opportunities twice a year with a number of free software organizations."
        
        
        
        
          
          , "tags": ["Concerts","Nwangele Music Festival"]
        
        , "date_published": "2019-12-15T19:16:49+00:00"
        

        
        
        
        
        

        , "author": {
          "name": "Fabian Ekwi"
          
          
        }
      }
    
  ]
}
